espressif/esp-idf/components/soc/esp32s2beta/include/soc/ledc_reg.h
// Copyright 2017-2018 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.
#ifndef _SOC_LEDC_REG_H_
#define _SOC_LEDC_REG_H_


#ifdef __cplusplus
extern "C" {
#endif
#include "soc.h"
#define LEDC_HSCH0_CONF0_REG          (DR_REG_LEDC_BASE + 0x0000)
/* LEDC_CLK_EN : R/W ;bitpos:[31] ;default: 1'h0 ; */
/*description: This bit is clock gating control signal. when software config
 LED_PWM internal registers  it controls the register clock.*/
#define LEDC_CLK_EN  (BIT(31))
#define LEDC_CLK_EN_M  (BIT(31))
#define LEDC_CLK_EN_V  0x1
#define LEDC_CLK_EN_S  31
/* LEDC_OVF_CNT_EN_HSCH0 : R/W ;bitpos:[14] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_EN_HSCH0  (BIT(14))
#define LEDC_OVF_CNT_EN_HSCH0_M  (BIT(14))
#define LEDC_OVF_CNT_EN_HSCH0_V  0x1
#define LEDC_OVF_CNT_EN_HSCH0_S  14
/* LEDC_OVF_NUM_HSCH0 : R/W ;bitpos:[13:4] ;default: 10'b0 ; */
/*description: */
#define LEDC_OVF_NUM_HSCH0  0x000003FF
#define LEDC_OVF_NUM_HSCH0_M  ((LEDC_OVF_NUM_HSCH0_V)<<(LEDC_OVF_NUM_HSCH0_S))
#define LEDC_OVF_NUM_HSCH0_V  0x3FF
#define LEDC_OVF_NUM_HSCH0_S  4
/* LEDC_IDLE_LV_HSCH0 : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: This bit is used to control the output value when high speed channel0 is off.*/
#define LEDC_IDLE_LV_HSCH0  (BIT(3))
#define LEDC_IDLE_LV_HSCH0_M  (BIT(3))
#define LEDC_IDLE_LV_HSCH0_V  0x1
#define LEDC_IDLE_LV_HSCH0_S  3
/* LEDC_SIG_OUT_EN_HSCH0 : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: This is the output enable control bit for high speed channel0*/
#define LEDC_SIG_OUT_EN_HSCH0  (BIT(2))
#define LEDC_SIG_OUT_EN_HSCH0_M  (BIT(2))
#define LEDC_SIG_OUT_EN_HSCH0_V  0x1
#define LEDC_SIG_OUT_EN_HSCH0_S  2
/* LEDC_TIMER_SEL_HSCH0 : R/W ;bitpos:[1:0] ;default: 2'd0 ; */
/*description: There are four high speed timers  the two bits are used to select
 one of them for high speed channel0.  2'b00: seletc hstimer0.   2'b01: select hstimer1.  2'b10: select hstimer2.    2'b11: select hstimer3.*/
#define LEDC_TIMER_SEL_HSCH0  0x00000003
#define LEDC_TIMER_SEL_HSCH0_M  ((LEDC_TIMER_SEL_HSCH0_V)<<(LEDC_TIMER_SEL_HSCH0_S))
#define LEDC_TIMER_SEL_HSCH0_V  0x3
#define LEDC_TIMER_SEL_HSCH0_S  0

#define LEDC_HSCH0_HPOINT_REG          (DR_REG_LEDC_BASE + 0x0004)
/* LEDC_HPOINT_HSCH0 : R/W ;bitpos:[19:0] ;default: 20'h0 ; */
/*description: The output value changes to high when htimerx(x=[0 3]) selected
 by high speed channel0 has reached reg_hpoint_hsch0[19:0]*/
#define LEDC_HPOINT_HSCH0  0x000FFFFF
#define LEDC_HPOINT_HSCH0_M  ((LEDC_HPOINT_HSCH0_V)<<(LEDC_HPOINT_HSCH0_S))
#define LEDC_HPOINT_HSCH0_V  0xFFFFF
#define LEDC_HPOINT_HSCH0_S  0

#define LEDC_HSCH0_DUTY_REG          (DR_REG_LEDC_BASE + 0x0008)
/* LEDC_DUTY_HSCH0 : R/W ;bitpos:[24:0] ;default: 25'h0 ; */
/*description: The register is used to control output duty. When hstimerx(x=[0
 3]) choosed by high speed channel0  has reached reg_lpoint_hsch0 the output signal changes to low. reg_lpoint_hsch0=(reg_hpoint_hsch0[19:0]+reg_duty_hsch0[24:4])          (1)  reg_lpoint_hsch0=(reg_hpoint_hsch0[19:0]+reg_duty_hsch0[24:4] +1)     (2)  The least four bits in this register represent the decimal part and determines when to choose (1) or (2)*/
#define LEDC_DUTY_HSCH0  0x01FFFFFF
#define LEDC_DUTY_HSCH0_M  ((LEDC_DUTY_HSCH0_V)<<(LEDC_DUTY_HSCH0_S))
#define LEDC_DUTY_HSCH0_V  0x1FFFFFF
#define LEDC_DUTY_HSCH0_S  0

#define LEDC_HSCH0_CONF1_REG          (DR_REG_LEDC_BASE + 0x000C)
/* LEDC_DUTY_START_HSCH0 : R/W ;bitpos:[31] ;default: 1'b0 ; */
/*description: When reg_duty_num_hsch0 reg_duty_cycle_hsch0 and reg_duty_scale_hsch0
 has been configured. these register won't take effect until set reg_duty_start_hsch0. this bit is automatically cleared by hardware.*/
#define LEDC_DUTY_START_HSCH0  (BIT(31))
#define LEDC_DUTY_START_HSCH0_M  (BIT(31))
#define LEDC_DUTY_START_HSCH0_V  0x1
#define LEDC_DUTY_START_HSCH0_S  31
/* LEDC_DUTY_INC_HSCH0 : R/W ;bitpos:[30] ;default: 1'b1 ; */
/*description: This register is used to increase the duty of output signal or
 decrease the duty of output signal for high speed channel0.*/
#define LEDC_DUTY_INC_HSCH0  (BIT(30))
#define LEDC_DUTY_INC_HSCH0_M  (BIT(30))
#define LEDC_DUTY_INC_HSCH0_V  0x1
#define LEDC_DUTY_INC_HSCH0_S  30
/* LEDC_DUTY_NUM_HSCH0 : R/W ;bitpos:[29:20] ;default: 10'h0 ; */
/*description: This register is used to control the num of increased or decreased
 times for high speed channel0.*/
#define LEDC_DUTY_NUM_HSCH0  0x000003FF
#define LEDC_DUTY_NUM_HSCH0_M  ((LEDC_DUTY_NUM_HSCH0_V)<<(LEDC_DUTY_NUM_HSCH0_S))
#define LEDC_DUTY_NUM_HSCH0_V  0x3FF
#define LEDC_DUTY_NUM_HSCH0_S  20
/* LEDC_DUTY_CYCLE_HSCH0 : R/W ;bitpos:[19:10] ;default: 10'h0 ; */
/*description: This register is used to increase or decrease the duty every
 reg_duty_cycle_hsch0 cycles for high speed channel0.*/
#define LEDC_DUTY_CYCLE_HSCH0  0x000003FF
#define LEDC_DUTY_CYCLE_HSCH0_M  ((LEDC_DUTY_CYCLE_HSCH0_V)<<(LEDC_DUTY_CYCLE_HSCH0_S))
#define LEDC_DUTY_CYCLE_HSCH0_V  0x3FF
#define LEDC_DUTY_CYCLE_HSCH0_S  10
/* LEDC_DUTY_SCALE_HSCH0 : R/W ;bitpos:[9:0] ;default: 10'h0 ; */
/*description: This register controls the increase or decrease step scale for
 high speed channel0.*/
#define LEDC_DUTY_SCALE_HSCH0  0x000003FF
#define LEDC_DUTY_SCALE_HSCH0_M  ((LEDC_DUTY_SCALE_HSCH0_V)<<(LEDC_DUTY_SCALE_HSCH0_S))
#define LEDC_DUTY_SCALE_HSCH0_V  0x3FF
#define LEDC_DUTY_SCALE_HSCH0_S  0

#define LEDC_HSCH0_DUTY_R_REG          (DR_REG_LEDC_BASE + 0x0010)
/* LEDC_DUTY_HSCH0 : RO ;bitpos:[24:0] ;default: 25'h0 ; */
/*description: This register represents the current duty of the output signal
 for high speed channel0.*/
#define LEDC_DUTY_HSCH0  0x01FFFFFF
#define LEDC_DUTY_HSCH0_M  ((LEDC_DUTY_HSCH0_V)<<(LEDC_DUTY_HSCH0_S))
#define LEDC_DUTY_HSCH0_V  0x1FFFFFF
#define LEDC_DUTY_HSCH0_S  0

