espressif/esp-idf/components/soc/esp32s2beta/include/soc/ledc_reg.h
#define LEDC_HSCH1_CONF0_REG          (DR_REG_LEDC_BASE + 0x0014)
/* LEDC_OVF_CNT_EN_HSCH1 : R/W ;bitpos:[14] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_EN_HSCH1  (BIT(14))
#define LEDC_OVF_CNT_EN_HSCH1_M  (BIT(14))
#define LEDC_OVF_CNT_EN_HSCH1_V  0x1
#define LEDC_OVF_CNT_EN_HSCH1_S  14
/* LEDC_OVF_NUM_HSCH1 : R/W ;bitpos:[13:4] ;default: 10'b0 ; */
/*description: */
#define LEDC_OVF_NUM_HSCH1  0x000003FF
#define LEDC_OVF_NUM_HSCH1_M  ((LEDC_OVF_NUM_HSCH1_V)<<(LEDC_OVF_NUM_HSCH1_S))
#define LEDC_OVF_NUM_HSCH1_V  0x3FF
#define LEDC_OVF_NUM_HSCH1_S  4
/* LEDC_IDLE_LV_HSCH1 : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: This bit is used to control the output value when high speed channel1 is off.*/
#define LEDC_IDLE_LV_HSCH1  (BIT(3))
#define LEDC_IDLE_LV_HSCH1_M  (BIT(3))
#define LEDC_IDLE_LV_HSCH1_V  0x1
#define LEDC_IDLE_LV_HSCH1_S  3
/* LEDC_SIG_OUT_EN_HSCH1 : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: This is the output enable control bit for high speed channel1*/
#define LEDC_SIG_OUT_EN_HSCH1  (BIT(2))
#define LEDC_SIG_OUT_EN_HSCH1_M  (BIT(2))
#define LEDC_SIG_OUT_EN_HSCH1_V  0x1
#define LEDC_SIG_OUT_EN_HSCH1_S  2
/* LEDC_TIMER_SEL_HSCH1 : R/W ;bitpos:[1:0] ;default: 2'd0 ; */
/*description: There are four high speed timers  the two bits are used to select
 one of them for high speed channel1.  2'b00: seletc hstimer0.   2'b01: select hstimer1.  2'b10: select hstimer2.    2'b11: select hstimer3.*/
#define LEDC_TIMER_SEL_HSCH1  0x00000003
#define LEDC_TIMER_SEL_HSCH1_M  ((LEDC_TIMER_SEL_HSCH1_V)<<(LEDC_TIMER_SEL_HSCH1_S))
#define LEDC_TIMER_SEL_HSCH1_V  0x3
#define LEDC_TIMER_SEL_HSCH1_S  0

#define LEDC_HSCH1_HPOINT_REG          (DR_REG_LEDC_BASE + 0x0018)
/* LEDC_HPOINT_HSCH1 : R/W ;bitpos:[19:0] ;default: 20'h0 ; */
/*description: The output value changes to high when htimerx(x=[0 3]) selected
 by high speed channel1 has reached reg_hpoint_hsch1[19:0]*/
#define LEDC_HPOINT_HSCH1  0x000FFFFF
#define LEDC_HPOINT_HSCH1_M  ((LEDC_HPOINT_HSCH1_V)<<(LEDC_HPOINT_HSCH1_S))
#define LEDC_HPOINT_HSCH1_V  0xFFFFF
#define LEDC_HPOINT_HSCH1_S  0

#define LEDC_HSCH1_DUTY_REG          (DR_REG_LEDC_BASE + 0x001C)
/* LEDC_DUTY_HSCH1 : R/W ;bitpos:[24:0] ;default: 25'h0 ; */
/*description: The register is used to control output duty. When hstimerx(x=[0
 3]) choosed by high speed channel1 has reached reg_lpoint_hsch1 the output signal changes to low. reg_lpoint_hsch1=(reg_hpoint_hsch1[19:0]+reg_duty_hsch1[24:4])          (1)  reg_lpoint_hsch1=(reg_hpoint_hsch1[19:0]+reg_duty_hsch1[24:4] +1)     (2)  The least four bits in this register represent the decimal part and determines when to choose (1) or (2)*/
#define LEDC_DUTY_HSCH1  0x01FFFFFF
#define LEDC_DUTY_HSCH1_M  ((LEDC_DUTY_HSCH1_V)<<(LEDC_DUTY_HSCH1_S))
#define LEDC_DUTY_HSCH1_V  0x1FFFFFF
#define LEDC_DUTY_HSCH1_S  0

#define LEDC_HSCH1_CONF1_REG          (DR_REG_LEDC_BASE + 0x0020)
/* LEDC_DUTY_START_HSCH1 : R/W ;bitpos:[31] ;default: 1'b0 ; */
/*description: When reg_duty_num_hsch1 reg_duty_cycle_hsch1 and reg_duty_scale_hsch1
 has been configured. these register won't take effect until set reg_duty_start_hsch1. this bit is automatically cleared by hardware.*/
#define LEDC_DUTY_START_HSCH1  (BIT(31))
#define LEDC_DUTY_START_HSCH1_M  (BIT(31))
#define LEDC_DUTY_START_HSCH1_V  0x1
#define LEDC_DUTY_START_HSCH1_S  31
/* LEDC_DUTY_INC_HSCH1 : R/W ;bitpos:[30] ;default: 1'b1 ; */
/*description: This register is used to increase the duty of output signal or
 decrease the duty of output signal for high speed channel1.*/
#define LEDC_DUTY_INC_HSCH1  (BIT(30))
#define LEDC_DUTY_INC_HSCH1_M  (BIT(30))
#define LEDC_DUTY_INC_HSCH1_V  0x1
#define LEDC_DUTY_INC_HSCH1_S  30
/* LEDC_DUTY_NUM_HSCH1 : R/W ;bitpos:[29:20] ;default: 10'h0 ; */
/*description: This register is used to control the num of increased or decreased
 times for high speed channel1.*/
#define LEDC_DUTY_NUM_HSCH1  0x000003FF
#define LEDC_DUTY_NUM_HSCH1_M  ((LEDC_DUTY_NUM_HSCH1_V)<<(LEDC_DUTY_NUM_HSCH1_S))
#define LEDC_DUTY_NUM_HSCH1_V  0x3FF
#define LEDC_DUTY_NUM_HSCH1_S  20
/* LEDC_DUTY_CYCLE_HSCH1 : R/W ;bitpos:[19:10] ;default: 10'h0 ; */
/*description: This register is used to increase or decrease the duty every
 reg_duty_cycle_hsch1 cycles for high speed channel1.*/
#define LEDC_DUTY_CYCLE_HSCH1  0x000003FF
#define LEDC_DUTY_CYCLE_HSCH1_M  ((LEDC_DUTY_CYCLE_HSCH1_V)<<(LEDC_DUTY_CYCLE_HSCH1_S))
#define LEDC_DUTY_CYCLE_HSCH1_V  0x3FF
#define LEDC_DUTY_CYCLE_HSCH1_S  10
/* LEDC_DUTY_SCALE_HSCH1 : R/W ;bitpos:[9:0] ;default: 10'h0 ; */
/*description: This register controls the increase or decrease step scale for
 high speed channel1.*/
#define LEDC_DUTY_SCALE_HSCH1  0x000003FF
#define LEDC_DUTY_SCALE_HSCH1_M  ((LEDC_DUTY_SCALE_HSCH1_V)<<(LEDC_DUTY_SCALE_HSCH1_S))
#define LEDC_DUTY_SCALE_HSCH1_V  0x3FF
#define LEDC_DUTY_SCALE_HSCH1_S  0

#define LEDC_HSCH1_DUTY_R_REG          (DR_REG_LEDC_BASE + 0x0024)
/* LEDC_DUTY_HSCH1 : RO ;bitpos:[24:0] ;default: 25'h0 ; */
/*description: This register represents the current duty of the output signal
 for high speed channel1.*/
#define LEDC_DUTY_HSCH1  0x01FFFFFF
#define LEDC_DUTY_HSCH1_M  ((LEDC_DUTY_HSCH1_V)<<(LEDC_DUTY_HSCH1_S))
#define LEDC_DUTY_HSCH1_V  0x1FFFFFF
#define LEDC_DUTY_HSCH1_S  0

#define LEDC_HSCH2_CONF0_REG          (DR_REG_LEDC_BASE + 0x0028)
/* LEDC_OVF_CNT_EN_HSCH2 : R/W ;bitpos:[14] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_EN_HSCH2  (BIT(14))
#define LEDC_OVF_CNT_EN_HSCH2_M  (BIT(14))
#define LEDC_OVF_CNT_EN_HSCH2_V  0x1
#define LEDC_OVF_CNT_EN_HSCH2_S  14
/* LEDC_OVF_NUM_HSCH2 : R/W ;bitpos:[13:4] ;default: 10'b0 ; */
/*description: */
#define LEDC_OVF_NUM_HSCH2  0x000003FF
#define LEDC_OVF_NUM_HSCH2_M  ((LEDC_OVF_NUM_HSCH2_V)<<(LEDC_OVF_NUM_HSCH2_S))
#define LEDC_OVF_NUM_HSCH2_V  0x3FF
#define LEDC_OVF_NUM_HSCH2_S  4
/* LEDC_IDLE_LV_HSCH2 : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: This bit is used to control the output value when high speed channel2 is off.*/
#define LEDC_IDLE_LV_HSCH2  (BIT(3))
#define LEDC_IDLE_LV_HSCH2_M  (BIT(3))
#define LEDC_IDLE_LV_HSCH2_V  0x1
#define LEDC_IDLE_LV_HSCH2_S  3
/* LEDC_SIG_OUT_EN_HSCH2 : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: This is the output enable control bit for high speed channel2*/
#define LEDC_SIG_OUT_EN_HSCH2  (BIT(2))
#define LEDC_SIG_OUT_EN_HSCH2_M  (BIT(2))
#define LEDC_SIG_OUT_EN_HSCH2_V  0x1
#define LEDC_SIG_OUT_EN_HSCH2_S  2
/* LEDC_TIMER_SEL_HSCH2 : R/W ;bitpos:[1:0] ;default: 2'd0 ; */
/*description: There are four high speed timers  the two bits are used to select
 one of them for high speed channel2.  2'b00: seletc hstimer0.   2'b01: select hstimer1.  2'b10: select hstimer2.    2'b11: select hstimer3.*/
#define LEDC_TIMER_SEL_HSCH2  0x00000003
#define LEDC_TIMER_SEL_HSCH2_M  ((LEDC_TIMER_SEL_HSCH2_V)<<(LEDC_TIMER_SEL_HSCH2_S))
#define LEDC_TIMER_SEL_HSCH2_V  0x3
#define LEDC_TIMER_SEL_HSCH2_S  0

#define LEDC_HSCH2_HPOINT_REG          (DR_REG_LEDC_BASE + 0x002C)
/* LEDC_HPOINT_HSCH2 : R/W ;bitpos:[19:0] ;default: 20'h0 ; */
/*description: The output value changes to high when htimerx(x=[0 3]) selected
 by high speed channel2 has reached reg_hpoint_hsch2[19:0]*/
#define LEDC_HPOINT_HSCH2  0x000FFFFF
#define LEDC_HPOINT_HSCH2_M  ((LEDC_HPOINT_HSCH2_V)<<(LEDC_HPOINT_HSCH2_S))
#define LEDC_HPOINT_HSCH2_V  0xFFFFF
#define LEDC_HPOINT_HSCH2_S  0

#define LEDC_HSCH2_DUTY_REG          (DR_REG_LEDC_BASE + 0x0030)
/* LEDC_DUTY_HSCH2 : R/W ;bitpos:[24:0] ;default: 25'h0 ; */
/*description: The register is used to control output duty. When hstimerx(x=[0
 3]) choosed by high speed channel2 has reached reg_lpoint_hsch2 the output signal changes to low. reg_lpoint_hsch2=(reg_hpoint_hsch2[19:0]+reg_duty_hsch2[24:4])          (1)  reg_lpoint_hsch2=(reg_hpoint_hsch2[19:0]+reg_duty_hsch2[24:4] +1)     (2)  The least four bits in this register represent the decimal part and determines when to choose (1) or (2)*/
#define LEDC_DUTY_HSCH2  0x01FFFFFF
#define LEDC_DUTY_HSCH2_M  ((LEDC_DUTY_HSCH2_V)<<(LEDC_DUTY_HSCH2_S))
#define LEDC_DUTY_HSCH2_V  0x1FFFFFF
#define LEDC_DUTY_HSCH2_S  0

