espressif/esp-idf/components/soc/esp32s2beta/include/soc/ledc_reg.h
#define LEDC_LSCH7_HPOINT_REG          (DR_REG_LEDC_BASE + 0x0130)
/* LEDC_HPOINT_LSCH7 : R/W ;bitpos:[19:0] ;default: 20'h0 ; */
/*description: The output value changes to high when lstimerx(x=[0 3]) selected
 by low speed channel7 has reached reg_hpoint_lsch7[19:0]*/
#define LEDC_HPOINT_LSCH7  0x000FFFFF
#define LEDC_HPOINT_LSCH7_M  ((LEDC_HPOINT_LSCH7_V)<<(LEDC_HPOINT_LSCH7_S))
#define LEDC_HPOINT_LSCH7_V  0xFFFFF
#define LEDC_HPOINT_LSCH7_S  0

#define LEDC_LSCH7_DUTY_REG          (DR_REG_LEDC_BASE + 0x0134)
/* LEDC_DUTY_LSCH7 : R/W ;bitpos:[24:0] ;default: 25'h0 ; */
/*description: The register is used to control output duty. When lstimerx(x=[0
 3]) choosed by low speed channel7 has reached reg_lpoint_lsch7 the output signal changes to low. reg_lpoint_lsch7=(reg_hpoint_lsch7[19:0]+reg_duty_lsch7[24:4])          (1)  reg_lpoint_lsch7=(reg_hpoint_lsch7[19:0]+reg_duty_lsch7[24:4] +1)     (2)  The least four bits in this register represent the decimal part and determines when to choose (1) or (2)*/
#define LEDC_DUTY_LSCH7  0x01FFFFFF
#define LEDC_DUTY_LSCH7_M  ((LEDC_DUTY_LSCH7_V)<<(LEDC_DUTY_LSCH7_S))
#define LEDC_DUTY_LSCH7_V  0x1FFFFFF
#define LEDC_DUTY_LSCH7_S  0

#define LEDC_LSCH7_CONF1_REG          (DR_REG_LEDC_BASE + 0x0138)
/* LEDC_DUTY_START_LSCH7 : R/W ;bitpos:[31] ;default: 1'b0 ; */
/*description: When reg_duty_num_hsch4  reg_duty_cycle_hsch4 and reg_duty_scale_hsch4
 has been configured. these register won't take effect until set reg_duty_start_hsch4. this bit is automatically cleared by hardware.*/
#define LEDC_DUTY_START_LSCH7  (BIT(31))
#define LEDC_DUTY_START_LSCH7_M  (BIT(31))
#define LEDC_DUTY_START_LSCH7_V  0x1
#define LEDC_DUTY_START_LSCH7_S  31
/* LEDC_DUTY_INC_LSCH7 : R/W ;bitpos:[30] ;default: 1'b1 ; */
/*description: This register is used to increase the duty of output signal or
 decrease the duty of output signal for low speed channel4.*/
#define LEDC_DUTY_INC_LSCH7  (BIT(30))
#define LEDC_DUTY_INC_LSCH7_M  (BIT(30))
#define LEDC_DUTY_INC_LSCH7_V  0x1
#define LEDC_DUTY_INC_LSCH7_S  30
/* LEDC_DUTY_NUM_LSCH7 : R/W ;bitpos:[29:20] ;default: 10'h0 ; */
/*description: This register is used to control the num of increased or decreased
 times for low speed channel4.*/
#define LEDC_DUTY_NUM_LSCH7  0x000003FF
#define LEDC_DUTY_NUM_LSCH7_M  ((LEDC_DUTY_NUM_LSCH7_V)<<(LEDC_DUTY_NUM_LSCH7_S))
#define LEDC_DUTY_NUM_LSCH7_V  0x3FF
#define LEDC_DUTY_NUM_LSCH7_S  20
/* LEDC_DUTY_CYCLE_LSCH7 : R/W ;bitpos:[19:10] ;default: 10'h0 ; */
/*description: This register is used to increase or decrease the duty every
 reg_duty_cycle_lsch7 cycles for low speed channel7.*/
#define LEDC_DUTY_CYCLE_LSCH7  0x000003FF
#define LEDC_DUTY_CYCLE_LSCH7_M  ((LEDC_DUTY_CYCLE_LSCH7_V)<<(LEDC_DUTY_CYCLE_LSCH7_S))
#define LEDC_DUTY_CYCLE_LSCH7_V  0x3FF
#define LEDC_DUTY_CYCLE_LSCH7_S  10
/* LEDC_DUTY_SCALE_LSCH7 : R/W ;bitpos:[9:0] ;default: 10'h0 ; */
/*description: This register controls the increase or decrease step scale for
 low speed channel7.*/
#define LEDC_DUTY_SCALE_LSCH7  0x000003FF
#define LEDC_DUTY_SCALE_LSCH7_M  ((LEDC_DUTY_SCALE_LSCH7_V)<<(LEDC_DUTY_SCALE_LSCH7_S))
#define LEDC_DUTY_SCALE_LSCH7_V  0x3FF
#define LEDC_DUTY_SCALE_LSCH7_S  0

#define LEDC_LSCH7_DUTY_R_REG          (DR_REG_LEDC_BASE + 0x013C)
/* LEDC_DUTY_LSCH7 : RO ;bitpos:[24:0] ;default: 25'h0 ; */
/*description: This register represents the current duty of the output signal
 for low speed channel7.*/
#define LEDC_DUTY_LSCH7  0x01FFFFFF
#define LEDC_DUTY_LSCH7_M  ((LEDC_DUTY_LSCH7_V)<<(LEDC_DUTY_LSCH7_S))
#define LEDC_DUTY_LSCH7_V  0x1FFFFFF
#define LEDC_DUTY_LSCH7_S  0

#define LEDC_HSTIMER0_CONF_REG          (DR_REG_LEDC_BASE + 0x0140)
/* LEDC_TICK_SEL_HSTIMER0 : R/W ;bitpos:[25] ;default: 1'b0 ; */
/*description: This bit is used to choose apb_clk or ref_tick for high speed
 timer0. 1'b1:apb_clk  0:ref_tick*/
#define LEDC_TICK_SEL_HSTIMER0  (BIT(25))
#define LEDC_TICK_SEL_HSTIMER0_M  (BIT(25))
#define LEDC_TICK_SEL_HSTIMER0_V  0x1
#define LEDC_TICK_SEL_HSTIMER0_S  25
/* LEDC_HSTIMER0_RST : R/W ;bitpos:[24] ;default: 1'b1 ; */
/*description: This bit is used to reset high speed timer0 the counter will be 0 after reset.*/
#define LEDC_HSTIMER0_RST  (BIT(24))
#define LEDC_HSTIMER0_RST_M  (BIT(24))
#define LEDC_HSTIMER0_RST_V  0x1
#define LEDC_HSTIMER0_RST_S  24
/* LEDC_HSTIMER0_PAUSE : R/W ;bitpos:[23] ;default: 1'b0 ; */
/*description: This bit is used to pause the counter in high speed timer0*/
#define LEDC_HSTIMER0_PAUSE  (BIT(23))
#define LEDC_HSTIMER0_PAUSE_M  (BIT(23))
#define LEDC_HSTIMER0_PAUSE_V  0x1
#define LEDC_HSTIMER0_PAUSE_S  23
/* LEDC_CLK_DIV_HSTIMER0 : R/W ;bitpos:[22:5] ;default: 18'h0 ; */
/*description: */
#define LEDC_CLK_DIV_HSTIMER0  0x0003FFFF
#define LEDC_CLK_DIV_HSTIMER0_M  ((LEDC_CLK_DIV_HSTIMER0_V)<<(LEDC_CLK_DIV_HSTIMER0_S))
#define LEDC_CLK_DIV_HSTIMER0_V  0x3FFFF
#define LEDC_CLK_DIV_HSTIMER0_S  5
/* LEDC_HSTIMER0_DUTY_RES : R/W ;bitpos:[4:0] ;default: 5'h0 ; */
/*description: */
#define LEDC_HSTIMER0_DUTY_RES  0x0000001F
#define LEDC_HSTIMER0_DUTY_RES_M  ((LEDC_HSTIMER0_DUTY_RES_V)<<(LEDC_HSTIMER0_DUTY_RES_S))
#define LEDC_HSTIMER0_DUTY_RES_V  0x1F
#define LEDC_HSTIMER0_DUTY_RES_S  0

#define LEDC_DIV_NUM_HSTIMER0    LEDC_CLK_DIV_HSTIMER0
#define LEDC_DIV_NUM_HSTIMER0_M  LEDC_CLK_DIV_HSTIMER0_M
#define LEDC_DIV_NUM_HSTIMER0_V  LEDC_CLK_DIV_HSTIMER0_V
#define LEDC_DIV_NUM_HSTIMER0_S  LEDC_CLK_DIV_HSTIMER0_S

#define LEDC_HSTIMER0_VALUE_REG          (DR_REG_LEDC_BASE + 0x0144)
/* LEDC_HSTIMER0_CNT : RO ;bitpos:[19:0] ;default: 20'b0 ; */
/*description: software can read this register to get the current counter value
 in high speed timer0*/
#define LEDC_HSTIMER0_CNT  0x000FFFFF
#define LEDC_HSTIMER0_CNT_M  ((LEDC_HSTIMER0_CNT_V)<<(LEDC_HSTIMER0_CNT_S))
#define LEDC_HSTIMER0_CNT_V  0xFFFFF
#define LEDC_HSTIMER0_CNT_S  0

#define LEDC_HSTIMER1_CONF_REG          (DR_REG_LEDC_BASE + 0x0148)
/* LEDC_TICK_SEL_HSTIMER1 : R/W ;bitpos:[25] ;default: 1'b0 ; */
/*description: This bit is used to choose apb_clk or ref_tick for high speed
 timer1. 1'b1:apb_clk  0:ref_tick*/
#define LEDC_TICK_SEL_HSTIMER1  (BIT(25))
#define LEDC_TICK_SEL_HSTIMER1_M  (BIT(25))
#define LEDC_TICK_SEL_HSTIMER1_V  0x1
#define LEDC_TICK_SEL_HSTIMER1_S  25
/* LEDC_HSTIMER1_RST : R/W ;bitpos:[24] ;default: 1'b1 ; */
/*description: This bit is used to reset high speed timer1 the counter will be 0 after reset.*/
#define LEDC_HSTIMER1_RST  (BIT(24))
#define LEDC_HSTIMER1_RST_M  (BIT(24))
#define LEDC_HSTIMER1_RST_V  0x1
#define LEDC_HSTIMER1_RST_S  24
/* LEDC_HSTIMER1_PAUSE : R/W ;bitpos:[23] ;default: 1'b0 ; */
/*description: This bit is used to pause the counter in high speed timer1*/
#define LEDC_HSTIMER1_PAUSE  (BIT(23))
#define LEDC_HSTIMER1_PAUSE_M  (BIT(23))
#define LEDC_HSTIMER1_PAUSE_V  0x1
#define LEDC_HSTIMER1_PAUSE_S  23
/* LEDC_CLK_DIV_HSTIMER1 : R/W ;bitpos:[22:5] ;default: 18'h0 ; */
/*description: */
#define LEDC_CLK_DIV_HSTIMER1  0x0003FFFF
#define LEDC_CLK_DIV_HSTIMER1_M  ((LEDC_CLK_DIV_HSTIMER1_V)<<(LEDC_CLK_DIV_HSTIMER1_S))
#define LEDC_CLK_DIV_HSTIMER1_V  0x3FFFF
#define LEDC_CLK_DIV_HSTIMER1_S  5
/* LEDC_HSTIMER1_DUTY_RES : R/W ;bitpos:[4:0] ;default: 5'h0 ; */
/*description: */
#define LEDC_HSTIMER1_DUTY_RES  0x0000001F
#define LEDC_HSTIMER1_DUTY_RES_M  ((LEDC_HSTIMER1_DUTY_RES_V)<<(LEDC_HSTIMER1_DUTY_RES_S))
#define LEDC_HSTIMER1_DUTY_RES_V  0x1F
#define LEDC_HSTIMER1_DUTY_RES_S  0

#define LEDC_HSTIMER1_VALUE_REG          (DR_REG_LEDC_BASE + 0x014C)
/* LEDC_HSTIMER1_CNT : RO ;bitpos:[19:0] ;default: 20'b0 ; */
/*description: software can read this register to get the current counter value
 in high speed timer1.*/
#define LEDC_HSTIMER1_CNT  0x000FFFFF
#define LEDC_HSTIMER1_CNT_M  ((LEDC_HSTIMER1_CNT_V)<<(LEDC_HSTIMER1_CNT_S))
#define LEDC_HSTIMER1_CNT_V  0xFFFFF
#define LEDC_HSTIMER1_CNT_S  0

#define LEDC_HSTIMER2_CONF_REG          (DR_REG_LEDC_BASE + 0x0150)
/* LEDC_TICK_SEL_HSTIMER2 : R/W ;bitpos:[25] ;default: 1'b0 ; */
/*description: This bit is used to choose apb_clk or ref_tick for high speed
 timer2. 1'b1:apb_clk  0:ref_tick*/
#define LEDC_TICK_SEL_HSTIMER2  (BIT(25))
#define LEDC_TICK_SEL_HSTIMER2_M  (BIT(25))
#define LEDC_TICK_SEL_HSTIMER2_V  0x1
#define LEDC_TICK_SEL_HSTIMER2_S  25
/* LEDC_HSTIMER2_RST : R/W ;bitpos:[24] ;default: 1'b1 ; */
/*description: This bit is used to reset high speed timer2 the counter will be 0 after reset.*/
#define LEDC_HSTIMER2_RST  (BIT(24))
#define LEDC_HSTIMER2_RST_M  (BIT(24))
#define LEDC_HSTIMER2_RST_V  0x1
#define LEDC_HSTIMER2_RST_S  24
/* LEDC_HSTIMER2_PAUSE : R/W ;bitpos:[23] ;default: 1'b0 ; */
/*description: This bit is used to pause the counter in high speed timer2*/
#define LEDC_HSTIMER2_PAUSE  (BIT(23))
#define LEDC_HSTIMER2_PAUSE_M  (BIT(23))
#define LEDC_HSTIMER2_PAUSE_V  0x1
#define LEDC_HSTIMER2_PAUSE_S  23
/* LEDC_CLK_DIV_HSTIMER2 : R/W ;bitpos:[22:5] ;default: 18'h0 ; */
/*description: */
#define LEDC_CLK_DIV_HSTIMER2  0x0003FFFF
#define LEDC_CLK_DIV_HSTIMER2_M  ((LEDC_CLK_DIV_HSTIMER2_V)<<(LEDC_CLK_DIV_HSTIMER2_S))
#define LEDC_CLK_DIV_HSTIMER2_V  0x3FFFF
#define LEDC_CLK_DIV_HSTIMER2_S  5
/* LEDC_HSTIMER2_DUTY_RES : R/W ;bitpos:[4:0] ;default: 5'h0 ; */
/*description: */
#define LEDC_HSTIMER2_DUTY_RES  0x0000001F
#define LEDC_HSTIMER2_DUTY_RES_M  ((LEDC_HSTIMER2_DUTY_RES_V)<<(LEDC_HSTIMER2_DUTY_RES_S))
#define LEDC_HSTIMER2_DUTY_RES_V  0x1F
#define LEDC_HSTIMER2_DUTY_RES_S  0

#define LEDC_HSTIMER2_VALUE_REG          (DR_REG_LEDC_BASE + 0x0154)
/* LEDC_HSTIMER2_CNT : RO ;bitpos:[19:0] ;default: 20'b0 ; */
/*description: software can read this register to get the current counter value
 in high speed timer2*/
#define LEDC_HSTIMER2_CNT  0x000FFFFF
#define LEDC_HSTIMER2_CNT_M  ((LEDC_HSTIMER2_CNT_V)<<(LEDC_HSTIMER2_CNT_S))
#define LEDC_HSTIMER2_CNT_V  0xFFFFF
#define LEDC_HSTIMER2_CNT_S  0

