espressif/esp-idf/components/soc/esp32s2beta/include/soc/ledc_reg.h
#define LEDC_LSTIMER3_VALUE_REG          (DR_REG_LEDC_BASE + 0x017C)
/* LEDC_LSTIMER3_CNT : RO ;bitpos:[19:0] ;default: 20'b0 ; */
/*description: software can read this register to get the current counter value
 in low speed timer3.*/
#define LEDC_LSTIMER3_CNT  0x000FFFFF
#define LEDC_LSTIMER3_CNT_M  ((LEDC_LSTIMER3_CNT_V)<<(LEDC_LSTIMER3_CNT_S))
#define LEDC_LSTIMER3_CNT_V  0xFFFFF
#define LEDC_LSTIMER3_CNT_S  0

#define LEDC_INT_RAW_REG          (DR_REG_LEDC_BASE + 0x0180)
/* LEDC_DUTY_CHNG_END_LSCH7_INT_RAW : RO ;bitpos:[23] ;default: 1'b0 ; */
/*description: The interrupt raw bit for low speed channel 7 duty change done.*/
#define LEDC_DUTY_CHNG_END_LSCH7_INT_RAW  (BIT(23))
#define LEDC_DUTY_CHNG_END_LSCH7_INT_RAW_M  (BIT(23))
#define LEDC_DUTY_CHNG_END_LSCH7_INT_RAW_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH7_INT_RAW_S  23
/* LEDC_DUTY_CHNG_END_LSCH6_INT_RAW : RO ;bitpos:[22] ;default: 1'b0 ; */
/*description: The interrupt raw bit for low speed channel 6 duty change done.*/
#define LEDC_DUTY_CHNG_END_LSCH6_INT_RAW  (BIT(22))
#define LEDC_DUTY_CHNG_END_LSCH6_INT_RAW_M  (BIT(22))
#define LEDC_DUTY_CHNG_END_LSCH6_INT_RAW_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH6_INT_RAW_S  22
/* LEDC_DUTY_CHNG_END_LSCH5_INT_RAW : RO ;bitpos:[21] ;default: 1'b0 ; */
/*description: The interrupt raw bit for low speed channel 5 duty change done.*/
#define LEDC_DUTY_CHNG_END_LSCH5_INT_RAW  (BIT(21))
#define LEDC_DUTY_CHNG_END_LSCH5_INT_RAW_M  (BIT(21))
#define LEDC_DUTY_CHNG_END_LSCH5_INT_RAW_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH5_INT_RAW_S  21
/* LEDC_DUTY_CHNG_END_LSCH4_INT_RAW : RO ;bitpos:[20] ;default: 1'b0 ; */
/*description: The interrupt raw bit for low speed channel 4 duty change done.*/
#define LEDC_DUTY_CHNG_END_LSCH4_INT_RAW  (BIT(20))
#define LEDC_DUTY_CHNG_END_LSCH4_INT_RAW_M  (BIT(20))
#define LEDC_DUTY_CHNG_END_LSCH4_INT_RAW_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH4_INT_RAW_S  20
/* LEDC_DUTY_CHNG_END_LSCH3_INT_RAW : RO ;bitpos:[19] ;default: 1'b0 ; */
/*description: The interrupt raw bit for low speed channel 3 duty change done.*/
#define LEDC_DUTY_CHNG_END_LSCH3_INT_RAW  (BIT(19))
#define LEDC_DUTY_CHNG_END_LSCH3_INT_RAW_M  (BIT(19))
#define LEDC_DUTY_CHNG_END_LSCH3_INT_RAW_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH3_INT_RAW_S  19
/* LEDC_DUTY_CHNG_END_LSCH2_INT_RAW : RO ;bitpos:[18] ;default: 1'b0 ; */
/*description: The interrupt raw bit for low speed channel 2 duty change done.*/
#define LEDC_DUTY_CHNG_END_LSCH2_INT_RAW  (BIT(18))
#define LEDC_DUTY_CHNG_END_LSCH2_INT_RAW_M  (BIT(18))
#define LEDC_DUTY_CHNG_END_LSCH2_INT_RAW_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH2_INT_RAW_S  18
/* LEDC_DUTY_CHNG_END_LSCH1_INT_RAW : RO ;bitpos:[17] ;default: 1'b0 ; */
/*description: The interrupt raw bit for low speed channel 1 duty change done.*/
#define LEDC_DUTY_CHNG_END_LSCH1_INT_RAW  (BIT(17))
#define LEDC_DUTY_CHNG_END_LSCH1_INT_RAW_M  (BIT(17))
#define LEDC_DUTY_CHNG_END_LSCH1_INT_RAW_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH1_INT_RAW_S  17
/* LEDC_DUTY_CHNG_END_LSCH0_INT_RAW : RO ;bitpos:[16] ;default: 1'b0 ; */
/*description: The interrupt raw bit for low speed channel 0 duty change done.*/
#define LEDC_DUTY_CHNG_END_LSCH0_INT_RAW  (BIT(16))
#define LEDC_DUTY_CHNG_END_LSCH0_INT_RAW_M  (BIT(16))
#define LEDC_DUTY_CHNG_END_LSCH0_INT_RAW_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH0_INT_RAW_S  16
/* LEDC_DUTY_CHNG_END_HSCH7_INT_RAW : RO ;bitpos:[15] ;default: 1'b0 ; */
/*description: The interrupt raw bit for high speed channel 7 duty change done.*/
#define LEDC_DUTY_CHNG_END_HSCH7_INT_RAW  (BIT(15))
#define LEDC_DUTY_CHNG_END_HSCH7_INT_RAW_M  (BIT(15))
#define LEDC_DUTY_CHNG_END_HSCH7_INT_RAW_V  0x1
#define LEDC_DUTY_CHNG_END_HSCH7_INT_RAW_S  15
/* LEDC_DUTY_CHNG_END_HSCH6_INT_RAW : RO ;bitpos:[14] ;default: 1'b0 ; */
/*description: The interrupt raw bit for high speed channel 6 duty change done.*/
#define LEDC_DUTY_CHNG_END_HSCH6_INT_RAW  (BIT(14))
#define LEDC_DUTY_CHNG_END_HSCH6_INT_RAW_M  (BIT(14))
#define LEDC_DUTY_CHNG_END_HSCH6_INT_RAW_V  0x1
#define LEDC_DUTY_CHNG_END_HSCH6_INT_RAW_S  14
/* LEDC_DUTY_CHNG_END_HSCH5_INT_RAW : RO ;bitpos:[13] ;default: 1'b0 ; */
/*description: The interrupt raw bit for high speed channel 5 duty change done.*/
#define LEDC_DUTY_CHNG_END_HSCH5_INT_RAW  (BIT(13))
#define LEDC_DUTY_CHNG_END_HSCH5_INT_RAW_M  (BIT(13))
#define LEDC_DUTY_CHNG_END_HSCH5_INT_RAW_V  0x1
#define LEDC_DUTY_CHNG_END_HSCH5_INT_RAW_S  13
/* LEDC_DUTY_CHNG_END_HSCH4_INT_RAW : RO ;bitpos:[12] ;default: 1'b0 ; */
/*description: The interrupt raw bit for high speed channel 4 duty change done.*/
#define LEDC_DUTY_CHNG_END_HSCH4_INT_RAW  (BIT(12))
#define LEDC_DUTY_CHNG_END_HSCH4_INT_RAW_M  (BIT(12))
#define LEDC_DUTY_CHNG_END_HSCH4_INT_RAW_V  0x1
#define LEDC_DUTY_CHNG_END_HSCH4_INT_RAW_S  12
/* LEDC_DUTY_CHNG_END_HSCH3_INT_RAW : RO ;bitpos:[11] ;default: 1'b0 ; */
/*description: The interrupt raw bit for high speed channel 3 duty change done.*/
#define LEDC_DUTY_CHNG_END_HSCH3_INT_RAW  (BIT(11))
#define LEDC_DUTY_CHNG_END_HSCH3_INT_RAW_M  (BIT(11))
#define LEDC_DUTY_CHNG_END_HSCH3_INT_RAW_V  0x1
#define LEDC_DUTY_CHNG_END_HSCH3_INT_RAW_S  11
/* LEDC_DUTY_CHNG_END_HSCH2_INT_RAW : RO ;bitpos:[10] ;default: 1'b0 ; */
/*description: The interrupt raw bit for high speed channel 2 duty change done.*/
#define LEDC_DUTY_CHNG_END_HSCH2_INT_RAW  (BIT(10))
#define LEDC_DUTY_CHNG_END_HSCH2_INT_RAW_M  (BIT(10))
#define LEDC_DUTY_CHNG_END_HSCH2_INT_RAW_V  0x1
#define LEDC_DUTY_CHNG_END_HSCH2_INT_RAW_S  10
/* LEDC_DUTY_CHNG_END_HSCH1_INT_RAW : RO ;bitpos:[9] ;default: 1'b0 ; */
/*description: The interrupt raw bit for high speed channel 1 duty change done.*/
#define LEDC_DUTY_CHNG_END_HSCH1_INT_RAW  (BIT(9))
#define LEDC_DUTY_CHNG_END_HSCH1_INT_RAW_M  (BIT(9))
#define LEDC_DUTY_CHNG_END_HSCH1_INT_RAW_V  0x1
#define LEDC_DUTY_CHNG_END_HSCH1_INT_RAW_S  9
/* LEDC_DUTY_CHNG_END_HSCH0_INT_RAW : RO ;bitpos:[8] ;default: 1'b0 ; */
/*description: The interrupt raw bit for high speed channel 0 duty change done.*/
#define LEDC_DUTY_CHNG_END_HSCH0_INT_RAW  (BIT(8))
#define LEDC_DUTY_CHNG_END_HSCH0_INT_RAW_M  (BIT(8))
#define LEDC_DUTY_CHNG_END_HSCH0_INT_RAW_V  0x1
#define LEDC_DUTY_CHNG_END_HSCH0_INT_RAW_S  8
/* LEDC_LSTIMER3_OVF_INT_RAW : RO ;bitpos:[7] ;default: 1'b0 ; */
/*description: The interrupt raw bit for low speed channel3  counter overflow.*/
#define LEDC_LSTIMER3_OVF_INT_RAW  (BIT(7))
#define LEDC_LSTIMER3_OVF_INT_RAW_M  (BIT(7))
#define LEDC_LSTIMER3_OVF_INT_RAW_V  0x1
#define LEDC_LSTIMER3_OVF_INT_RAW_S  7
/* LEDC_LSTIMER2_OVF_INT_RAW : RO ;bitpos:[6] ;default: 1'b0 ; */
/*description: The interrupt raw bit for low speed channel2  counter overflow.*/
#define LEDC_LSTIMER2_OVF_INT_RAW  (BIT(6))
#define LEDC_LSTIMER2_OVF_INT_RAW_M  (BIT(6))
#define LEDC_LSTIMER2_OVF_INT_RAW_V  0x1
#define LEDC_LSTIMER2_OVF_INT_RAW_S  6
/* LEDC_LSTIMER1_OVF_INT_RAW : RO ;bitpos:[5] ;default: 1'b0 ; */
/*description: The interrupt raw bit for low speed channel1  counter overflow.*/
#define LEDC_LSTIMER1_OVF_INT_RAW  (BIT(5))
#define LEDC_LSTIMER1_OVF_INT_RAW_M  (BIT(5))
#define LEDC_LSTIMER1_OVF_INT_RAW_V  0x1
#define LEDC_LSTIMER1_OVF_INT_RAW_S  5
/* LEDC_LSTIMER0_OVF_INT_RAW : RO ;bitpos:[4] ;default: 1'b0 ; */
/*description: The interrupt raw bit for low speed channel0  counter overflow.*/
#define LEDC_LSTIMER0_OVF_INT_RAW  (BIT(4))
#define LEDC_LSTIMER0_OVF_INT_RAW_M  (BIT(4))
#define LEDC_LSTIMER0_OVF_INT_RAW_V  0x1
#define LEDC_LSTIMER0_OVF_INT_RAW_S  4
/* LEDC_HSTIMER3_OVF_INT_RAW : RO ;bitpos:[3] ;default: 1'b0 ; */
/*description: The interrupt raw bit for high speed channel3  counter overflow.*/
#define LEDC_HSTIMER3_OVF_INT_RAW  (BIT(3))
#define LEDC_HSTIMER3_OVF_INT_RAW_M  (BIT(3))
#define LEDC_HSTIMER3_OVF_INT_RAW_V  0x1
#define LEDC_HSTIMER3_OVF_INT_RAW_S  3
/* LEDC_HSTIMER2_OVF_INT_RAW : RO ;bitpos:[2] ;default: 1'b0 ; */
/*description: The interrupt raw bit for high speed channel2  counter overflow.*/
#define LEDC_HSTIMER2_OVF_INT_RAW  (BIT(2))
#define LEDC_HSTIMER2_OVF_INT_RAW_M  (BIT(2))
#define LEDC_HSTIMER2_OVF_INT_RAW_V  0x1
#define LEDC_HSTIMER2_OVF_INT_RAW_S  2
/* LEDC_HSTIMER1_OVF_INT_RAW : RO ;bitpos:[1] ;default: 1'b0 ; */
/*description: The interrupt raw bit for high speed channel1  counter overflow.*/
#define LEDC_HSTIMER1_OVF_INT_RAW  (BIT(1))
#define LEDC_HSTIMER1_OVF_INT_RAW_M  (BIT(1))
#define LEDC_HSTIMER1_OVF_INT_RAW_V  0x1
#define LEDC_HSTIMER1_OVF_INT_RAW_S  1
/* LEDC_HSTIMER0_OVF_INT_RAW : RO ;bitpos:[0] ;default: 1'b0 ; */
/*description: The interrupt raw bit for high speed channel0  counter overflow.*/
#define LEDC_HSTIMER0_OVF_INT_RAW  (BIT(0))
#define LEDC_HSTIMER0_OVF_INT_RAW_M  (BIT(0))
#define LEDC_HSTIMER0_OVF_INT_RAW_V  0x1
#define LEDC_HSTIMER0_OVF_INT_RAW_S  0

#define LEDC_INT_ST_REG          (DR_REG_LEDC_BASE + 0x0184)
/* LEDC_DUTY_CHNG_END_LSCH7_INT_ST : RO ;bitpos:[23] ;default: 1'h0 ; */
/*description: The interrupt status bit for low speed channel 7 duty change done event*/
#define LEDC_DUTY_CHNG_END_LSCH7_INT_ST  (BIT(23))
#define LEDC_DUTY_CHNG_END_LSCH7_INT_ST_M  (BIT(23))
#define LEDC_DUTY_CHNG_END_LSCH7_INT_ST_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH7_INT_ST_S  23
/* LEDC_DUTY_CHNG_END_LSCH6_INT_ST : RO ;bitpos:[22] ;default: 1'b0 ; */
/*description: The interrupt status bit for low speed channel 6 duty change done event.*/
#define LEDC_DUTY_CHNG_END_LSCH6_INT_ST  (BIT(22))
#define LEDC_DUTY_CHNG_END_LSCH6_INT_ST_M  (BIT(22))
#define LEDC_DUTY_CHNG_END_LSCH6_INT_ST_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH6_INT_ST_S  22
/* LEDC_DUTY_CHNG_END_LSCH5_INT_ST : RO ;bitpos:[21] ;default: 1'b0 ; */
/*description: The interrupt status bit for low speed channel 5 duty change done event.*/
#define LEDC_DUTY_CHNG_END_LSCH5_INT_ST  (BIT(21))
#define LEDC_DUTY_CHNG_END_LSCH5_INT_ST_M  (BIT(21))
#define LEDC_DUTY_CHNG_END_LSCH5_INT_ST_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH5_INT_ST_S  21
/* LEDC_DUTY_CHNG_END_LSCH4_INT_ST : RO ;bitpos:[20] ;default: 1'b0 ; */
/*description: The interrupt status bit for low speed channel 4 duty change done event.*/
#define LEDC_DUTY_CHNG_END_LSCH4_INT_ST  (BIT(20))
#define LEDC_DUTY_CHNG_END_LSCH4_INT_ST_M  (BIT(20))
#define LEDC_DUTY_CHNG_END_LSCH4_INT_ST_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH4_INT_ST_S  20
/* LEDC_DUTY_CHNG_END_LSCH3_INT_ST : RO ;bitpos:[19] ;default: 1'b0 ; */
/*description: The interrupt status bit for low speed channel 3 duty change done event.*/
#define LEDC_DUTY_CHNG_END_LSCH3_INT_ST  (BIT(19))
#define LEDC_DUTY_CHNG_END_LSCH3_INT_ST_M  (BIT(19))
#define LEDC_DUTY_CHNG_END_LSCH3_INT_ST_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH3_INT_ST_S  19
/* LEDC_DUTY_CHNG_END_LSCH2_INT_ST : RO ;bitpos:[18] ;default: 1'b0 ; */
/*description: The interrupt status bit for low speed channel 2 duty change done event.*/
#define LEDC_DUTY_CHNG_END_LSCH2_INT_ST  (BIT(18))
#define LEDC_DUTY_CHNG_END_LSCH2_INT_ST_M  (BIT(18))
#define LEDC_DUTY_CHNG_END_LSCH2_INT_ST_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH2_INT_ST_S  18
/* LEDC_DUTY_CHNG_END_LSCH1_INT_ST : RO ;bitpos:[17] ;default: 1'b0 ; */
/*description: The interrupt status bit for low speed channel 1 duty change done event.*/
#define LEDC_DUTY_CHNG_END_LSCH1_INT_ST  (BIT(17))
#define LEDC_DUTY_CHNG_END_LSCH1_INT_ST_M  (BIT(17))
#define LEDC_DUTY_CHNG_END_LSCH1_INT_ST_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH1_INT_ST_S  17
/* LEDC_DUTY_CHNG_END_LSCH0_INT_ST : RO ;bitpos:[16] ;default: 1'b0 ; */
/*description: The interrupt status bit for low speed channel 0 duty change done event.*/
#define LEDC_DUTY_CHNG_END_LSCH0_INT_ST  (BIT(16))
#define LEDC_DUTY_CHNG_END_LSCH0_INT_ST_M  (BIT(16))
#define LEDC_DUTY_CHNG_END_LSCH0_INT_ST_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH0_INT_ST_S  16
/* LEDC_DUTY_CHNG_END_HSCH7_INT_ST : RO ;bitpos:[15] ;default: 1'b0 ; */
/*description: The interrupt status bit for high speed channel 7 duty change done event.*/
#define LEDC_DUTY_CHNG_END_HSCH7_INT_ST  (BIT(15))
#define LEDC_DUTY_CHNG_END_HSCH7_INT_ST_M  (BIT(15))
#define LEDC_DUTY_CHNG_END_HSCH7_INT_ST_V  0x1
#define LEDC_DUTY_CHNG_END_HSCH7_INT_ST_S  15
/* LEDC_DUTY_CHNG_END_HSCH6_INT_ST : RO ;bitpos:[14] ;default: 1'b0 ; */
/*description: The interrupt status bit for high speed channel 6 duty change done event.*/
#define LEDC_DUTY_CHNG_END_HSCH6_INT_ST  (BIT(14))
#define LEDC_DUTY_CHNG_END_HSCH6_INT_ST_M  (BIT(14))
#define LEDC_DUTY_CHNG_END_HSCH6_INT_ST_V  0x1
#define LEDC_DUTY_CHNG_END_HSCH6_INT_ST_S  14
/* LEDC_DUTY_CHNG_END_HSCH5_INT_ST : RO ;bitpos:[13] ;default: 1'b0 ; */
/*description: The interrupt status bit for high speed channel 5 duty change done event.*/
#define LEDC_DUTY_CHNG_END_HSCH5_INT_ST  (BIT(13))
#define LEDC_DUTY_CHNG_END_HSCH5_INT_ST_M  (BIT(13))
#define LEDC_DUTY_CHNG_END_HSCH5_INT_ST_V  0x1
#define LEDC_DUTY_CHNG_END_HSCH5_INT_ST_S  13
/* LEDC_DUTY_CHNG_END_HSCH4_INT_ST : RO ;bitpos:[12] ;default: 1'b0 ; */
/*description: The interrupt status bit for high speed channel 4 duty change done event.*/
#define LEDC_DUTY_CHNG_END_HSCH4_INT_ST  (BIT(12))
#define LEDC_DUTY_CHNG_END_HSCH4_INT_ST_M  (BIT(12))
#define LEDC_DUTY_CHNG_END_HSCH4_INT_ST_V  0x1
#define LEDC_DUTY_CHNG_END_HSCH4_INT_ST_S  12
/* LEDC_DUTY_CHNG_END_HSCH3_INT_ST : RO ;bitpos:[11] ;default: 1'b0 ; */
/*description: The interrupt status bit for high speed channel 3 duty change done event.*/
#define LEDC_DUTY_CHNG_END_HSCH3_INT_ST  (BIT(11))
#define LEDC_DUTY_CHNG_END_HSCH3_INT_ST_M  (BIT(11))
#define LEDC_DUTY_CHNG_END_HSCH3_INT_ST_V  0x1
#define LEDC_DUTY_CHNG_END_HSCH3_INT_ST_S  11
/* LEDC_DUTY_CHNG_END_HSCH2_INT_ST : RO ;bitpos:[10] ;default: 1'b0 ; */
/*description: The interrupt status bit for high speed channel 2 duty change done event.*/
#define LEDC_DUTY_CHNG_END_HSCH2_INT_ST  (BIT(10))
#define LEDC_DUTY_CHNG_END_HSCH2_INT_ST_M  (BIT(10))
#define LEDC_DUTY_CHNG_END_HSCH2_INT_ST_V  0x1
#define LEDC_DUTY_CHNG_END_HSCH2_INT_ST_S  10
/* LEDC_DUTY_CHNG_END_HSCH1_INT_ST : RO ;bitpos:[9] ;default: 1'b0 ; */
/*description: The interrupt status bit for high speed channel 1 duty change done event.*/
#define LEDC_DUTY_CHNG_END_HSCH1_INT_ST  (BIT(9))
#define LEDC_DUTY_CHNG_END_HSCH1_INT_ST_M  (BIT(9))
#define LEDC_DUTY_CHNG_END_HSCH1_INT_ST_V  0x1
#define LEDC_DUTY_CHNG_END_HSCH1_INT_ST_S  9
/* LEDC_DUTY_CHNG_END_HSCH0_INT_ST : RO ;bitpos:[8] ;default: 1'b0 ; */
/*description: The interrupt status bit for high speed channel 0 duty change done event.*/
#define LEDC_DUTY_CHNG_END_HSCH0_INT_ST  (BIT(8))
#define LEDC_DUTY_CHNG_END_HSCH0_INT_ST_M  (BIT(8))
#define LEDC_DUTY_CHNG_END_HSCH0_INT_ST_V  0x1
#define LEDC_DUTY_CHNG_END_HSCH0_INT_ST_S  8
/* LEDC_LSTIMER3_OVF_INT_ST : RO ;bitpos:[7] ;default: 1'b0 ; */
/*description: The interrupt status bit for low speed channel3  counter overflow event.*/
#define LEDC_LSTIMER3_OVF_INT_ST  (BIT(7))
#define LEDC_LSTIMER3_OVF_INT_ST_M  (BIT(7))
#define LEDC_LSTIMER3_OVF_INT_ST_V  0x1
#define LEDC_LSTIMER3_OVF_INT_ST_S  7
/* LEDC_LSTIMER2_OVF_INT_ST : RO ;bitpos:[6] ;default: 1'b0 ; */
/*description: The interrupt status bit for low speed channel2  counter overflow event.*/
#define LEDC_LSTIMER2_OVF_INT_ST  (BIT(6))
#define LEDC_LSTIMER2_OVF_INT_ST_M  (BIT(6))
#define LEDC_LSTIMER2_OVF_INT_ST_V  0x1
#define LEDC_LSTIMER2_OVF_INT_ST_S  6
/* LEDC_LSTIMER1_OVF_INT_ST : RO ;bitpos:[5] ;default: 1'b0 ; */
/*description: The interrupt status bit for low speed channel1  counter overflow event.*/
#define LEDC_LSTIMER1_OVF_INT_ST  (BIT(5))
#define LEDC_LSTIMER1_OVF_INT_ST_M  (BIT(5))
#define LEDC_LSTIMER1_OVF_INT_ST_V  0x1
#define LEDC_LSTIMER1_OVF_INT_ST_S  5
/* LEDC_LSTIMER0_OVF_INT_ST : RO ;bitpos:[4] ;default: 1'b0 ; */
/*description: The interrupt status bit for low speed channel0  counter overflow event.*/
#define LEDC_LSTIMER0_OVF_INT_ST  (BIT(4))
#define LEDC_LSTIMER0_OVF_INT_ST_M  (BIT(4))
#define LEDC_LSTIMER0_OVF_INT_ST_V  0x1
#define LEDC_LSTIMER0_OVF_INT_ST_S  4
/* LEDC_HSTIMER3_OVF_INT_ST : RO ;bitpos:[3] ;default: 1'b0 ; */
/*description: The interrupt status bit for high speed channel3  counter overflow event.*/
#define LEDC_HSTIMER3_OVF_INT_ST  (BIT(3))
#define LEDC_HSTIMER3_OVF_INT_ST_M  (BIT(3))
#define LEDC_HSTIMER3_OVF_INT_ST_V  0x1
#define LEDC_HSTIMER3_OVF_INT_ST_S  3
/* LEDC_HSTIMER2_OVF_INT_ST : RO ;bitpos:[2] ;default: 1'b0 ; */
/*description: The interrupt status bit for high speed channel2  counter overflow event.*/
#define LEDC_HSTIMER2_OVF_INT_ST  (BIT(2))
#define LEDC_HSTIMER2_OVF_INT_ST_M  (BIT(2))
#define LEDC_HSTIMER2_OVF_INT_ST_V  0x1
#define LEDC_HSTIMER2_OVF_INT_ST_S  2
/* LEDC_HSTIMER1_OVF_INT_ST : RO ;bitpos:[1] ;default: 1'b0 ; */
/*description: The interrupt status bit for high speed channel1  counter overflow event.*/
#define LEDC_HSTIMER1_OVF_INT_ST  (BIT(1))
#define LEDC_HSTIMER1_OVF_INT_ST_M  (BIT(1))
#define LEDC_HSTIMER1_OVF_INT_ST_V  0x1
#define LEDC_HSTIMER1_OVF_INT_ST_S  1
/* LEDC_HSTIMER0_OVF_INT_ST : RO ;bitpos:[0] ;default: 1'b0 ; */
/*description: The interrupt status bit for high speed channel0  counter overflow event.*/
#define LEDC_HSTIMER0_OVF_INT_ST  (BIT(0))
#define LEDC_HSTIMER0_OVF_INT_ST_M  (BIT(0))
#define LEDC_HSTIMER0_OVF_INT_ST_V  0x1
#define LEDC_HSTIMER0_OVF_INT_ST_S  0

