espressif/esp-idf/components/soc/esp32s2beta/include/soc/ledc_reg.h
#define LEDC_INT_ENA_REG          (DR_REG_LEDC_BASE + 0x0188)
/* LEDC_DUTY_CHNG_END_LSCH7_INT_ENA : R/W ;bitpos:[23] ;default: 1'h0 ; */
/*description: The interrupt enable bit for low speed channel 7 duty change done interrupt.*/
#define LEDC_DUTY_CHNG_END_LSCH7_INT_ENA  (BIT(23))
#define LEDC_DUTY_CHNG_END_LSCH7_INT_ENA_M  (BIT(23))
#define LEDC_DUTY_CHNG_END_LSCH7_INT_ENA_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH7_INT_ENA_S  23
/* LEDC_DUTY_CHNG_END_LSCH6_INT_ENA : R/W ;bitpos:[22] ;default: 1'b0 ; */
/*description: The interrupt enable bit for low speed channel 6 duty change done interrupt.*/
#define LEDC_DUTY_CHNG_END_LSCH6_INT_ENA  (BIT(22))
#define LEDC_DUTY_CHNG_END_LSCH6_INT_ENA_M  (BIT(22))
#define LEDC_DUTY_CHNG_END_LSCH6_INT_ENA_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH6_INT_ENA_S  22
/* LEDC_DUTY_CHNG_END_LSCH5_INT_ENA : R/W ;bitpos:[21] ;default: 1'b0 ; */
/*description: The interrupt enable bit for low speed channel 5 duty change done interrupt.*/
#define LEDC_DUTY_CHNG_END_LSCH5_INT_ENA  (BIT(21))
#define LEDC_DUTY_CHNG_END_LSCH5_INT_ENA_M  (BIT(21))
#define LEDC_DUTY_CHNG_END_LSCH5_INT_ENA_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH5_INT_ENA_S  21
/* LEDC_DUTY_CHNG_END_LSCH4_INT_ENA : R/W ;bitpos:[20] ;default: 1'b0 ; */
/*description: The interrupt enable bit for low speed channel 4 duty change done interrupt.*/
#define LEDC_DUTY_CHNG_END_LSCH4_INT_ENA  (BIT(20))
#define LEDC_DUTY_CHNG_END_LSCH4_INT_ENA_M  (BIT(20))
#define LEDC_DUTY_CHNG_END_LSCH4_INT_ENA_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH4_INT_ENA_S  20
/* LEDC_DUTY_CHNG_END_LSCH3_INT_ENA : R/W ;bitpos:[19] ;default: 1'b0 ; */
/*description: The interrupt enable bit for low speed channel 3 duty change done interrupt.*/
#define LEDC_DUTY_CHNG_END_LSCH3_INT_ENA  (BIT(19))
#define LEDC_DUTY_CHNG_END_LSCH3_INT_ENA_M  (BIT(19))
#define LEDC_DUTY_CHNG_END_LSCH3_INT_ENA_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH3_INT_ENA_S  19
/* LEDC_DUTY_CHNG_END_LSCH2_INT_ENA : R/W ;bitpos:[18] ;default: 1'b0 ; */
/*description: The interrupt enable bit for low speed channel 2 duty change done interrupt.*/
#define LEDC_DUTY_CHNG_END_LSCH2_INT_ENA  (BIT(18))
#define LEDC_DUTY_CHNG_END_LSCH2_INT_ENA_M  (BIT(18))
#define LEDC_DUTY_CHNG_END_LSCH2_INT_ENA_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH2_INT_ENA_S  18
/* LEDC_DUTY_CHNG_END_LSCH1_INT_ENA : R/W ;bitpos:[17] ;default: 1'b0 ; */
/*description: The interrupt enable bit for low speed channel 1 duty change done interrupt.*/
#define LEDC_DUTY_CHNG_END_LSCH1_INT_ENA  (BIT(17))
#define LEDC_DUTY_CHNG_END_LSCH1_INT_ENA_M  (BIT(17))
#define LEDC_DUTY_CHNG_END_LSCH1_INT_ENA_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH1_INT_ENA_S  17
/* LEDC_DUTY_CHNG_END_LSCH0_INT_ENA : R/W ;bitpos:[16] ;default: 1'b0 ; */
/*description: The interrupt enable bit for low speed channel 0 duty change done interrupt.*/
#define LEDC_DUTY_CHNG_END_LSCH0_INT_ENA  (BIT(16))
#define LEDC_DUTY_CHNG_END_LSCH0_INT_ENA_M  (BIT(16))
#define LEDC_DUTY_CHNG_END_LSCH0_INT_ENA_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH0_INT_ENA_S  16
/* LEDC_DUTY_CHNG_END_HSCH7_INT_ENA : R/W ;bitpos:[15] ;default: 1'b0 ; */
/*description: The interrupt enable bit for high speed channel 7 duty change done interrupt.*/
#define LEDC_DUTY_CHNG_END_HSCH7_INT_ENA  (BIT(15))
#define LEDC_DUTY_CHNG_END_HSCH7_INT_ENA_M  (BIT(15))
#define LEDC_DUTY_CHNG_END_HSCH7_INT_ENA_V  0x1
#define LEDC_DUTY_CHNG_END_HSCH7_INT_ENA_S  15
/* LEDC_DUTY_CHNG_END_HSCH6_INT_ENA : R/W ;bitpos:[14] ;default: 1'b0 ; */
/*description: The interrupt enable bit for high speed channel 6 duty change done interrupt.*/
#define LEDC_DUTY_CHNG_END_HSCH6_INT_ENA  (BIT(14))
#define LEDC_DUTY_CHNG_END_HSCH6_INT_ENA_M  (BIT(14))
#define LEDC_DUTY_CHNG_END_HSCH6_INT_ENA_V  0x1
#define LEDC_DUTY_CHNG_END_HSCH6_INT_ENA_S  14
/* LEDC_DUTY_CHNG_END_HSCH5_INT_ENA : R/W ;bitpos:[13] ;default: 1'b0 ; */
/*description: The interrupt enable bit for high speed channel 5 duty change done interrupt.*/
#define LEDC_DUTY_CHNG_END_HSCH5_INT_ENA  (BIT(13))
#define LEDC_DUTY_CHNG_END_HSCH5_INT_ENA_M  (BIT(13))
#define LEDC_DUTY_CHNG_END_HSCH5_INT_ENA_V  0x1
#define LEDC_DUTY_CHNG_END_HSCH5_INT_ENA_S  13
/* LEDC_DUTY_CHNG_END_HSCH4_INT_ENA : R/W ;bitpos:[12] ;default: 1'b0 ; */
/*description: The interrupt enable bit for high speed channel 4 duty change done interrupt.*/
#define LEDC_DUTY_CHNG_END_HSCH4_INT_ENA  (BIT(12))
#define LEDC_DUTY_CHNG_END_HSCH4_INT_ENA_M  (BIT(12))
#define LEDC_DUTY_CHNG_END_HSCH4_INT_ENA_V  0x1
#define LEDC_DUTY_CHNG_END_HSCH4_INT_ENA_S  12
/* LEDC_DUTY_CHNG_END_HSCH3_INT_ENA : R/W ;bitpos:[11] ;default: 1'b0 ; */
/*description: The interrupt enable bit for high speed channel 3 duty change done interrupt.*/
#define LEDC_DUTY_CHNG_END_HSCH3_INT_ENA  (BIT(11))
#define LEDC_DUTY_CHNG_END_HSCH3_INT_ENA_M  (BIT(11))
#define LEDC_DUTY_CHNG_END_HSCH3_INT_ENA_V  0x1
#define LEDC_DUTY_CHNG_END_HSCH3_INT_ENA_S  11
/* LEDC_DUTY_CHNG_END_HSCH2_INT_ENA : R/W ;bitpos:[10] ;default: 1'b0 ; */
/*description: The interrupt enable bit for high speed channel 2 duty change done interrupt.*/
#define LEDC_DUTY_CHNG_END_HSCH2_INT_ENA  (BIT(10))
#define LEDC_DUTY_CHNG_END_HSCH2_INT_ENA_M  (BIT(10))
#define LEDC_DUTY_CHNG_END_HSCH2_INT_ENA_V  0x1
#define LEDC_DUTY_CHNG_END_HSCH2_INT_ENA_S  10
/* LEDC_DUTY_CHNG_END_HSCH1_INT_ENA : R/W ;bitpos:[9] ;default: 1'b0 ; */
/*description: The interrupt enable bit for high speed channel 1 duty change done interrupt.*/
#define LEDC_DUTY_CHNG_END_HSCH1_INT_ENA  (BIT(9))
#define LEDC_DUTY_CHNG_END_HSCH1_INT_ENA_M  (BIT(9))
#define LEDC_DUTY_CHNG_END_HSCH1_INT_ENA_V  0x1
#define LEDC_DUTY_CHNG_END_HSCH1_INT_ENA_S  9
/* LEDC_DUTY_CHNG_END_HSCH0_INT_ENA : R/W ;bitpos:[8] ;default: 1'b0 ; */
/*description: The interrupt enable bit for high speed channel 0 duty change done interrupt.*/
#define LEDC_DUTY_CHNG_END_HSCH0_INT_ENA  (BIT(8))
#define LEDC_DUTY_CHNG_END_HSCH0_INT_ENA_M  (BIT(8))
#define LEDC_DUTY_CHNG_END_HSCH0_INT_ENA_V  0x1
#define LEDC_DUTY_CHNG_END_HSCH0_INT_ENA_S  8
/* LEDC_LSTIMER3_OVF_INT_ENA : R/W ;bitpos:[7] ;default: 1'b0 ; */
/*description: The interrupt enable bit for low speed channel3  counter overflow interrupt.*/
#define LEDC_LSTIMER3_OVF_INT_ENA  (BIT(7))
#define LEDC_LSTIMER3_OVF_INT_ENA_M  (BIT(7))
#define LEDC_LSTIMER3_OVF_INT_ENA_V  0x1
#define LEDC_LSTIMER3_OVF_INT_ENA_S  7
/* LEDC_LSTIMER2_OVF_INT_ENA : R/W ;bitpos:[6] ;default: 1'b0 ; */
/*description: The interrupt enable bit for low speed channel2  counter overflow interrupt.*/
#define LEDC_LSTIMER2_OVF_INT_ENA  (BIT(6))
#define LEDC_LSTIMER2_OVF_INT_ENA_M  (BIT(6))
#define LEDC_LSTIMER2_OVF_INT_ENA_V  0x1
#define LEDC_LSTIMER2_OVF_INT_ENA_S  6
/* LEDC_LSTIMER1_OVF_INT_ENA : R/W ;bitpos:[5] ;default: 1'b0 ; */
/*description: The interrupt enable bit for low speed channel1  counter overflow interrupt.*/
#define LEDC_LSTIMER1_OVF_INT_ENA  (BIT(5))
#define LEDC_LSTIMER1_OVF_INT_ENA_M  (BIT(5))
#define LEDC_LSTIMER1_OVF_INT_ENA_V  0x1
#define LEDC_LSTIMER1_OVF_INT_ENA_S  5
/* LEDC_LSTIMER0_OVF_INT_ENA : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: The interrupt enable bit for low speed channel0  counter overflow interrupt.*/
#define LEDC_LSTIMER0_OVF_INT_ENA  (BIT(4))
#define LEDC_LSTIMER0_OVF_INT_ENA_M  (BIT(4))
#define LEDC_LSTIMER0_OVF_INT_ENA_V  0x1
#define LEDC_LSTIMER0_OVF_INT_ENA_S  4
/* LEDC_HSTIMER3_OVF_INT_ENA : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: The interrupt enable bit for high speed channel3  counter overflow interrupt.*/
#define LEDC_HSTIMER3_OVF_INT_ENA  (BIT(3))
#define LEDC_HSTIMER3_OVF_INT_ENA_M  (BIT(3))
#define LEDC_HSTIMER3_OVF_INT_ENA_V  0x1
#define LEDC_HSTIMER3_OVF_INT_ENA_S  3
/* LEDC_HSTIMER2_OVF_INT_ENA : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: The interrupt enable bit for high speed channel2  counter overflow interrupt.*/
#define LEDC_HSTIMER2_OVF_INT_ENA  (BIT(2))
#define LEDC_HSTIMER2_OVF_INT_ENA_M  (BIT(2))
#define LEDC_HSTIMER2_OVF_INT_ENA_V  0x1
#define LEDC_HSTIMER2_OVF_INT_ENA_S  2
/* LEDC_HSTIMER1_OVF_INT_ENA : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: The interrupt enable bit for high speed channel1  counter overflow interrupt.*/
#define LEDC_HSTIMER1_OVF_INT_ENA  (BIT(1))
#define LEDC_HSTIMER1_OVF_INT_ENA_M  (BIT(1))
#define LEDC_HSTIMER1_OVF_INT_ENA_V  0x1
#define LEDC_HSTIMER1_OVF_INT_ENA_S  1
/* LEDC_HSTIMER0_OVF_INT_ENA : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: The interrupt enable bit for high speed channel0  counter overflow interrupt.*/
#define LEDC_HSTIMER0_OVF_INT_ENA  (BIT(0))
#define LEDC_HSTIMER0_OVF_INT_ENA_M  (BIT(0))
#define LEDC_HSTIMER0_OVF_INT_ENA_V  0x1
#define LEDC_HSTIMER0_OVF_INT_ENA_S  0

#define LEDC_INT_CLR_REG          (DR_REG_LEDC_BASE + 0x018C)
/* LEDC_DUTY_CHNG_END_LSCH7_INT_CLR : WO ;bitpos:[23] ;default: 1'h0 ; */
/*description: Set this  bit to clear  low speed channel 7 duty change done interrupt.*/
#define LEDC_DUTY_CHNG_END_LSCH7_INT_CLR  (BIT(23))
#define LEDC_DUTY_CHNG_END_LSCH7_INT_CLR_M  (BIT(23))
#define LEDC_DUTY_CHNG_END_LSCH7_INT_CLR_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH7_INT_CLR_S  23
/* LEDC_DUTY_CHNG_END_LSCH6_INT_CLR : WO ;bitpos:[22] ;default: 1'b0 ; */
/*description: Set this  bit to clear  low speed channel 6 duty change done interrupt.*/
#define LEDC_DUTY_CHNG_END_LSCH6_INT_CLR  (BIT(22))
#define LEDC_DUTY_CHNG_END_LSCH6_INT_CLR_M  (BIT(22))
#define LEDC_DUTY_CHNG_END_LSCH6_INT_CLR_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH6_INT_CLR_S  22
/* LEDC_DUTY_CHNG_END_LSCH5_INT_CLR : WO ;bitpos:[21] ;default: 1'b0 ; */
/*description: Set this  bit to clear  low speed channel 5 duty change done interrupt.*/
#define LEDC_DUTY_CHNG_END_LSCH5_INT_CLR  (BIT(21))
#define LEDC_DUTY_CHNG_END_LSCH5_INT_CLR_M  (BIT(21))
#define LEDC_DUTY_CHNG_END_LSCH5_INT_CLR_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH5_INT_CLR_S  21
/* LEDC_DUTY_CHNG_END_LSCH4_INT_CLR : WO ;bitpos:[20] ;default: 1'b0 ; */
/*description: Set this  bit to clear  low speed channel 4 duty change done interrupt.*/
#define LEDC_DUTY_CHNG_END_LSCH4_INT_CLR  (BIT(20))
#define LEDC_DUTY_CHNG_END_LSCH4_INT_CLR_M  (BIT(20))
#define LEDC_DUTY_CHNG_END_LSCH4_INT_CLR_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH4_INT_CLR_S  20
/* LEDC_DUTY_CHNG_END_LSCH3_INT_CLR : WO ;bitpos:[19] ;default: 1'b0 ; */
/*description: Set this  bit to clear  low speed channel 3 duty change done interrupt.*/
#define LEDC_DUTY_CHNG_END_LSCH3_INT_CLR  (BIT(19))
#define LEDC_DUTY_CHNG_END_LSCH3_INT_CLR_M  (BIT(19))
#define LEDC_DUTY_CHNG_END_LSCH3_INT_CLR_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH3_INT_CLR_S  19
/* LEDC_DUTY_CHNG_END_LSCH2_INT_CLR : WO ;bitpos:[18] ;default: 1'b0 ; */
/*description: Set this  bit to clear  low speed channel 2 duty change done interrupt.*/
#define LEDC_DUTY_CHNG_END_LSCH2_INT_CLR  (BIT(18))
#define LEDC_DUTY_CHNG_END_LSCH2_INT_CLR_M  (BIT(18))
#define LEDC_DUTY_CHNG_END_LSCH2_INT_CLR_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH2_INT_CLR_S  18
/* LEDC_DUTY_CHNG_END_LSCH1_INT_CLR : WO ;bitpos:[17] ;default: 1'b0 ; */
/*description: Set this  bit to clear  low speed channel 1 duty change done interrupt.*/
#define LEDC_DUTY_CHNG_END_LSCH1_INT_CLR  (BIT(17))
#define LEDC_DUTY_CHNG_END_LSCH1_INT_CLR_M  (BIT(17))
#define LEDC_DUTY_CHNG_END_LSCH1_INT_CLR_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH1_INT_CLR_S  17
/* LEDC_DUTY_CHNG_END_LSCH0_INT_CLR : WO ;bitpos:[16] ;default: 1'b0 ; */
/*description: Set this  bit to clear  low speed channel 0 duty change done interrupt.*/
#define LEDC_DUTY_CHNG_END_LSCH0_INT_CLR  (BIT(16))
#define LEDC_DUTY_CHNG_END_LSCH0_INT_CLR_M  (BIT(16))
#define LEDC_DUTY_CHNG_END_LSCH0_INT_CLR_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH0_INT_CLR_S  16
/* LEDC_DUTY_CHNG_END_HSCH7_INT_CLR : WO ;bitpos:[15] ;default: 1'b0 ; */
/*description: Set this  bit to clear  high speed channel 7 duty change done interrupt.*/
#define LEDC_DUTY_CHNG_END_HSCH7_INT_CLR  (BIT(15))
#define LEDC_DUTY_CHNG_END_HSCH7_INT_CLR_M  (BIT(15))
#define LEDC_DUTY_CHNG_END_HSCH7_INT_CLR_V  0x1
#define LEDC_DUTY_CHNG_END_HSCH7_INT_CLR_S  15
/* LEDC_DUTY_CHNG_END_HSCH6_INT_CLR : WO ;bitpos:[14] ;default: 1'b0 ; */
/*description: Set this  bit to clear  high speed channel 6 duty change done interrupt.*/
#define LEDC_DUTY_CHNG_END_HSCH6_INT_CLR  (BIT(14))
#define LEDC_DUTY_CHNG_END_HSCH6_INT_CLR_M  (BIT(14))
#define LEDC_DUTY_CHNG_END_HSCH6_INT_CLR_V  0x1
#define LEDC_DUTY_CHNG_END_HSCH6_INT_CLR_S  14
/* LEDC_DUTY_CHNG_END_HSCH5_INT_CLR : WO ;bitpos:[13] ;default: 1'b0 ; */
/*description: Set this  bit to clear  high speed channel 5 duty change done interrupt.*/
#define LEDC_DUTY_CHNG_END_HSCH5_INT_CLR  (BIT(13))
#define LEDC_DUTY_CHNG_END_HSCH5_INT_CLR_M  (BIT(13))
#define LEDC_DUTY_CHNG_END_HSCH5_INT_CLR_V  0x1
#define LEDC_DUTY_CHNG_END_HSCH5_INT_CLR_S  13
/* LEDC_DUTY_CHNG_END_HSCH4_INT_CLR : WO ;bitpos:[12] ;default: 1'b0 ; */
/*description: Set this  bit to clear  high speed channel 4 duty change done interrupt.*/
#define LEDC_DUTY_CHNG_END_HSCH4_INT_CLR  (BIT(12))
#define LEDC_DUTY_CHNG_END_HSCH4_INT_CLR_M  (BIT(12))
#define LEDC_DUTY_CHNG_END_HSCH4_INT_CLR_V  0x1
#define LEDC_DUTY_CHNG_END_HSCH4_INT_CLR_S  12
/* LEDC_DUTY_CHNG_END_HSCH3_INT_CLR : WO ;bitpos:[11] ;default: 1'b0 ; */
/*description: Set this  bit to clear  high speed channel 3 duty change done interrupt.*/
#define LEDC_DUTY_CHNG_END_HSCH3_INT_CLR  (BIT(11))
#define LEDC_DUTY_CHNG_END_HSCH3_INT_CLR_M  (BIT(11))
#define LEDC_DUTY_CHNG_END_HSCH3_INT_CLR_V  0x1
#define LEDC_DUTY_CHNG_END_HSCH3_INT_CLR_S  11
/* LEDC_DUTY_CHNG_END_HSCH2_INT_CLR : WO ;bitpos:[10] ;default: 1'b0 ; */
/*description: Set this  bit to clear  high speed channel 2 duty change done interrupt.*/
#define LEDC_DUTY_CHNG_END_HSCH2_INT_CLR  (BIT(10))
#define LEDC_DUTY_CHNG_END_HSCH2_INT_CLR_M  (BIT(10))
#define LEDC_DUTY_CHNG_END_HSCH2_INT_CLR_V  0x1
#define LEDC_DUTY_CHNG_END_HSCH2_INT_CLR_S  10
/* LEDC_DUTY_CHNG_END_HSCH1_INT_CLR : WO ;bitpos:[9] ;default: 1'b0 ; */
/*description: Set this  bit to clear  high speed channel 1 duty change done interrupt.*/
#define LEDC_DUTY_CHNG_END_HSCH1_INT_CLR  (BIT(9))
#define LEDC_DUTY_CHNG_END_HSCH1_INT_CLR_M  (BIT(9))
#define LEDC_DUTY_CHNG_END_HSCH1_INT_CLR_V  0x1
#define LEDC_DUTY_CHNG_END_HSCH1_INT_CLR_S  9
/* LEDC_DUTY_CHNG_END_HSCH0_INT_CLR : WO ;bitpos:[8] ;default: 1'b0 ; */
/*description: Set this  bit to clear  high speed channel 0 duty change done interrupt.*/
#define LEDC_DUTY_CHNG_END_HSCH0_INT_CLR  (BIT(8))
#define LEDC_DUTY_CHNG_END_HSCH0_INT_CLR_M  (BIT(8))
#define LEDC_DUTY_CHNG_END_HSCH0_INT_CLR_V  0x1
#define LEDC_DUTY_CHNG_END_HSCH0_INT_CLR_S  8
/* LEDC_LSTIMER3_OVF_INT_CLR : WO ;bitpos:[7] ;default: 1'b0 ; */
/*description: Set this  bit to clear  low speed channel3  counter overflow interrupt.*/
#define LEDC_LSTIMER3_OVF_INT_CLR  (BIT(7))
#define LEDC_LSTIMER3_OVF_INT_CLR_M  (BIT(7))
#define LEDC_LSTIMER3_OVF_INT_CLR_V  0x1
#define LEDC_LSTIMER3_OVF_INT_CLR_S  7
/* LEDC_LSTIMER2_OVF_INT_CLR : WO ;bitpos:[6] ;default: 1'b0 ; */
/*description: Set this  bit to clear  low speed channel2  counter overflow interrupt.*/
#define LEDC_LSTIMER2_OVF_INT_CLR  (BIT(6))
#define LEDC_LSTIMER2_OVF_INT_CLR_M  (BIT(6))
#define LEDC_LSTIMER2_OVF_INT_CLR_V  0x1
#define LEDC_LSTIMER2_OVF_INT_CLR_S  6
/* LEDC_LSTIMER1_OVF_INT_CLR : WO ;bitpos:[5] ;default: 1'b0 ; */
/*description: Set this  bit to clear  low speed channel1  counter overflow interrupt.*/
#define LEDC_LSTIMER1_OVF_INT_CLR  (BIT(5))
#define LEDC_LSTIMER1_OVF_INT_CLR_M  (BIT(5))
#define LEDC_LSTIMER1_OVF_INT_CLR_V  0x1
#define LEDC_LSTIMER1_OVF_INT_CLR_S  5
/* LEDC_LSTIMER0_OVF_INT_CLR : WO ;bitpos:[4] ;default: 1'b0 ; */
/*description: Set this  bit to clear  low speed channel0  counter overflow interrupt.*/
#define LEDC_LSTIMER0_OVF_INT_CLR  (BIT(4))
#define LEDC_LSTIMER0_OVF_INT_CLR_M  (BIT(4))
#define LEDC_LSTIMER0_OVF_INT_CLR_V  0x1
#define LEDC_LSTIMER0_OVF_INT_CLR_S  4
/* LEDC_HSTIMER3_OVF_INT_CLR : WO ;bitpos:[3] ;default: 1'b0 ; */
/*description: Set this  bit to clear  high speed channel3  counter overflow interrupt.*/
#define LEDC_HSTIMER3_OVF_INT_CLR  (BIT(3))
#define LEDC_HSTIMER3_OVF_INT_CLR_M  (BIT(3))
#define LEDC_HSTIMER3_OVF_INT_CLR_V  0x1
#define LEDC_HSTIMER3_OVF_INT_CLR_S  3
/* LEDC_HSTIMER2_OVF_INT_CLR : WO ;bitpos:[2] ;default: 1'b0 ; */
/*description: Set this  bit to clear  high speed channel2  counter overflow interrupt.*/
#define LEDC_HSTIMER2_OVF_INT_CLR  (BIT(2))
#define LEDC_HSTIMER2_OVF_INT_CLR_M  (BIT(2))
#define LEDC_HSTIMER2_OVF_INT_CLR_V  0x1
#define LEDC_HSTIMER2_OVF_INT_CLR_S  2
/* LEDC_HSTIMER1_OVF_INT_CLR : WO ;bitpos:[1] ;default: 1'b0 ; */
/*description: Set this  bit to clear  high speed channel1  counter overflow interrupt.*/
#define LEDC_HSTIMER1_OVF_INT_CLR  (BIT(1))
#define LEDC_HSTIMER1_OVF_INT_CLR_M  (BIT(1))
#define LEDC_HSTIMER1_OVF_INT_CLR_V  0x1
#define LEDC_HSTIMER1_OVF_INT_CLR_S  1
/* LEDC_HSTIMER0_OVF_INT_CLR : WO ;bitpos:[0] ;default: 1'b0 ; */
/*description: Set this  bit to clear  high speed channel0  counter overflow interrupt.*/
#define LEDC_HSTIMER0_OVF_INT_CLR  (BIT(0))
#define LEDC_HSTIMER0_OVF_INT_CLR_M  (BIT(0))
#define LEDC_HSTIMER0_OVF_INT_CLR_V  0x1
#define LEDC_HSTIMER0_OVF_INT_CLR_S  0

#define LEDC_CONF_REG          (DR_REG_LEDC_BASE + 0x0190)
/* LEDC_APB_CLK_SEL : R/W ;bitpos:[1:0] ;default: 2'b0 ; */
/*description: */
#define LEDC_APB_CLK_SEL  0x00000003
#define LEDC_APB_CLK_SEL_M  ((LEDC_APB_CLK_SEL_V)<<(LEDC_APB_CLK_SEL_S))
#define LEDC_APB_CLK_SEL_V  0x3
#define LEDC_APB_CLK_SEL_S  0

