espressif/esp-idf/components/soc/esp32s2beta/include/soc/ledc_reg.h
#define LEDC_INT1_RAW_REG          (DR_REG_LEDC_BASE + 0x0194)
/* LEDC_OVF_CNT_LSCH7_INT_RAW : RO ;bitpos:[15] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_LSCH7_INT_RAW  (BIT(15))
#define LEDC_OVF_CNT_LSCH7_INT_RAW_M  (BIT(15))
#define LEDC_OVF_CNT_LSCH7_INT_RAW_V  0x1
#define LEDC_OVF_CNT_LSCH7_INT_RAW_S  15
/* LEDC_OVF_CNT_LSCH6_INT_RAW : RO ;bitpos:[14] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_LSCH6_INT_RAW  (BIT(14))
#define LEDC_OVF_CNT_LSCH6_INT_RAW_M  (BIT(14))
#define LEDC_OVF_CNT_LSCH6_INT_RAW_V  0x1
#define LEDC_OVF_CNT_LSCH6_INT_RAW_S  14
/* LEDC_OVF_CNT_LSCH5_INT_RAW : RO ;bitpos:[13] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_LSCH5_INT_RAW  (BIT(13))
#define LEDC_OVF_CNT_LSCH5_INT_RAW_M  (BIT(13))
#define LEDC_OVF_CNT_LSCH5_INT_RAW_V  0x1
#define LEDC_OVF_CNT_LSCH5_INT_RAW_S  13
/* LEDC_OVF_CNT_LSCH4_INT_RAW : RO ;bitpos:[12] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_LSCH4_INT_RAW  (BIT(12))
#define LEDC_OVF_CNT_LSCH4_INT_RAW_M  (BIT(12))
#define LEDC_OVF_CNT_LSCH4_INT_RAW_V  0x1
#define LEDC_OVF_CNT_LSCH4_INT_RAW_S  12
/* LEDC_OVF_CNT_LSCH3_INT_RAW : RO ;bitpos:[11] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_LSCH3_INT_RAW  (BIT(11))
#define LEDC_OVF_CNT_LSCH3_INT_RAW_M  (BIT(11))
#define LEDC_OVF_CNT_LSCH3_INT_RAW_V  0x1
#define LEDC_OVF_CNT_LSCH3_INT_RAW_S  11
/* LEDC_OVF_CNT_LSCH2_INT_RAW : RO ;bitpos:[10] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_LSCH2_INT_RAW  (BIT(10))
#define LEDC_OVF_CNT_LSCH2_INT_RAW_M  (BIT(10))
#define LEDC_OVF_CNT_LSCH2_INT_RAW_V  0x1
#define LEDC_OVF_CNT_LSCH2_INT_RAW_S  10
/* LEDC_OVF_CNT_LSCH1_INT_RAW : RO ;bitpos:[9] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_LSCH1_INT_RAW  (BIT(9))
#define LEDC_OVF_CNT_LSCH1_INT_RAW_M  (BIT(9))
#define LEDC_OVF_CNT_LSCH1_INT_RAW_V  0x1
#define LEDC_OVF_CNT_LSCH1_INT_RAW_S  9
/* LEDC_OVF_CNT_LSCH0_INT_RAW : RO ;bitpos:[8] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_LSCH0_INT_RAW  (BIT(8))
#define LEDC_OVF_CNT_LSCH0_INT_RAW_M  (BIT(8))
#define LEDC_OVF_CNT_LSCH0_INT_RAW_V  0x1
#define LEDC_OVF_CNT_LSCH0_INT_RAW_S  8
/* LEDC_OVF_CNT_HSCH7_INT_RAW : RO ;bitpos:[7] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_HSCH7_INT_RAW  (BIT(7))
#define LEDC_OVF_CNT_HSCH7_INT_RAW_M  (BIT(7))
#define LEDC_OVF_CNT_HSCH7_INT_RAW_V  0x1
#define LEDC_OVF_CNT_HSCH7_INT_RAW_S  7
/* LEDC_OVF_CNT_HSCH6_INT_RAW : RO ;bitpos:[6] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_HSCH6_INT_RAW  (BIT(6))
#define LEDC_OVF_CNT_HSCH6_INT_RAW_M  (BIT(6))
#define LEDC_OVF_CNT_HSCH6_INT_RAW_V  0x1
#define LEDC_OVF_CNT_HSCH6_INT_RAW_S  6
/* LEDC_OVF_CNT_HSCH5_INT_RAW : RO ;bitpos:[5] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_HSCH5_INT_RAW  (BIT(5))
#define LEDC_OVF_CNT_HSCH5_INT_RAW_M  (BIT(5))
#define LEDC_OVF_CNT_HSCH5_INT_RAW_V  0x1
#define LEDC_OVF_CNT_HSCH5_INT_RAW_S  5
/* LEDC_OVF_CNT_HSCH4_INT_RAW : RO ;bitpos:[4] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_HSCH4_INT_RAW  (BIT(4))
#define LEDC_OVF_CNT_HSCH4_INT_RAW_M  (BIT(4))
#define LEDC_OVF_CNT_HSCH4_INT_RAW_V  0x1
#define LEDC_OVF_CNT_HSCH4_INT_RAW_S  4
/* LEDC_OVF_CNT_HSCH3_INT_RAW : RO ;bitpos:[3] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_HSCH3_INT_RAW  (BIT(3))
#define LEDC_OVF_CNT_HSCH3_INT_RAW_M  (BIT(3))
#define LEDC_OVF_CNT_HSCH3_INT_RAW_V  0x1
#define LEDC_OVF_CNT_HSCH3_INT_RAW_S  3
/* LEDC_OVF_CNT_HSCH2_INT_RAW : RO ;bitpos:[2] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_HSCH2_INT_RAW  (BIT(2))
#define LEDC_OVF_CNT_HSCH2_INT_RAW_M  (BIT(2))
#define LEDC_OVF_CNT_HSCH2_INT_RAW_V  0x1
#define LEDC_OVF_CNT_HSCH2_INT_RAW_S  2
/* LEDC_OVF_CNT_HSCH1_INT_RAW : RO ;bitpos:[1] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_HSCH1_INT_RAW  (BIT(1))
#define LEDC_OVF_CNT_HSCH1_INT_RAW_M  (BIT(1))
#define LEDC_OVF_CNT_HSCH1_INT_RAW_V  0x1
#define LEDC_OVF_CNT_HSCH1_INT_RAW_S  1
/* LEDC_OVF_CNT_HSCH0_INT_RAW : RO ;bitpos:[0] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_HSCH0_INT_RAW  (BIT(0))
#define LEDC_OVF_CNT_HSCH0_INT_RAW_M  (BIT(0))
#define LEDC_OVF_CNT_HSCH0_INT_RAW_V  0x1
#define LEDC_OVF_CNT_HSCH0_INT_RAW_S  0

#define LEDC_INT1_ST_REG          (DR_REG_LEDC_BASE + 0x0198)
/* LEDC_OVF_CNT_LSCH7_INT_ST : RO ;bitpos:[15] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_LSCH7_INT_ST  (BIT(15))
#define LEDC_OVF_CNT_LSCH7_INT_ST_M  (BIT(15))
#define LEDC_OVF_CNT_LSCH7_INT_ST_V  0x1
#define LEDC_OVF_CNT_LSCH7_INT_ST_S  15
/* LEDC_OVF_CNT_LSCH6_INT_ST : RO ;bitpos:[14] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_LSCH6_INT_ST  (BIT(14))
#define LEDC_OVF_CNT_LSCH6_INT_ST_M  (BIT(14))
#define LEDC_OVF_CNT_LSCH6_INT_ST_V  0x1
#define LEDC_OVF_CNT_LSCH6_INT_ST_S  14
/* LEDC_OVF_CNT_LSCH5_INT_ST : RO ;bitpos:[13] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_LSCH5_INT_ST  (BIT(13))
#define LEDC_OVF_CNT_LSCH5_INT_ST_M  (BIT(13))
#define LEDC_OVF_CNT_LSCH5_INT_ST_V  0x1
#define LEDC_OVF_CNT_LSCH5_INT_ST_S  13
/* LEDC_OVF_CNT_LSCH4_INT_ST : RO ;bitpos:[12] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_LSCH4_INT_ST  (BIT(12))
#define LEDC_OVF_CNT_LSCH4_INT_ST_M  (BIT(12))
#define LEDC_OVF_CNT_LSCH4_INT_ST_V  0x1
#define LEDC_OVF_CNT_LSCH4_INT_ST_S  12
/* LEDC_OVF_CNT_LSCH3_INT_ST : RO ;bitpos:[11] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_LSCH3_INT_ST  (BIT(11))
#define LEDC_OVF_CNT_LSCH3_INT_ST_M  (BIT(11))
#define LEDC_OVF_CNT_LSCH3_INT_ST_V  0x1
#define LEDC_OVF_CNT_LSCH3_INT_ST_S  11
/* LEDC_OVF_CNT_LSCH2_INT_ST : RO ;bitpos:[10] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_LSCH2_INT_ST  (BIT(10))
#define LEDC_OVF_CNT_LSCH2_INT_ST_M  (BIT(10))
#define LEDC_OVF_CNT_LSCH2_INT_ST_V  0x1
#define LEDC_OVF_CNT_LSCH2_INT_ST_S  10
/* LEDC_OVF_CNT_LSCH1_INT_ST : RO ;bitpos:[9] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_LSCH1_INT_ST  (BIT(9))
#define LEDC_OVF_CNT_LSCH1_INT_ST_M  (BIT(9))
#define LEDC_OVF_CNT_LSCH1_INT_ST_V  0x1
#define LEDC_OVF_CNT_LSCH1_INT_ST_S  9
/* LEDC_OVF_CNT_LSCH0_INT_ST : RO ;bitpos:[8] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_LSCH0_INT_ST  (BIT(8))
#define LEDC_OVF_CNT_LSCH0_INT_ST_M  (BIT(8))
#define LEDC_OVF_CNT_LSCH0_INT_ST_V  0x1
#define LEDC_OVF_CNT_LSCH0_INT_ST_S  8
/* LEDC_OVF_CNT_HSCH7_INT_ST : RO ;bitpos:[7] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_HSCH7_INT_ST  (BIT(7))
#define LEDC_OVF_CNT_HSCH7_INT_ST_M  (BIT(7))
#define LEDC_OVF_CNT_HSCH7_INT_ST_V  0x1
#define LEDC_OVF_CNT_HSCH7_INT_ST_S  7
/* LEDC_OVF_CNT_HSCH6_INT_ST : RO ;bitpos:[6] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_HSCH6_INT_ST  (BIT(6))
#define LEDC_OVF_CNT_HSCH6_INT_ST_M  (BIT(6))
#define LEDC_OVF_CNT_HSCH6_INT_ST_V  0x1
#define LEDC_OVF_CNT_HSCH6_INT_ST_S  6
/* LEDC_OVF_CNT_HSCH5_INT_ST : RO ;bitpos:[5] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_HSCH5_INT_ST  (BIT(5))
#define LEDC_OVF_CNT_HSCH5_INT_ST_M  (BIT(5))
#define LEDC_OVF_CNT_HSCH5_INT_ST_V  0x1
#define LEDC_OVF_CNT_HSCH5_INT_ST_S  5
/* LEDC_OVF_CNT_HSCH4_INT_ST : RO ;bitpos:[4] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_HSCH4_INT_ST  (BIT(4))
#define LEDC_OVF_CNT_HSCH4_INT_ST_M  (BIT(4))
#define LEDC_OVF_CNT_HSCH4_INT_ST_V  0x1
#define LEDC_OVF_CNT_HSCH4_INT_ST_S  4
/* LEDC_OVF_CNT_HSCH3_INT_ST : RO ;bitpos:[3] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_HSCH3_INT_ST  (BIT(3))
#define LEDC_OVF_CNT_HSCH3_INT_ST_M  (BIT(3))
#define LEDC_OVF_CNT_HSCH3_INT_ST_V  0x1
#define LEDC_OVF_CNT_HSCH3_INT_ST_S  3
/* LEDC_OVF_CNT_HSCH2_INT_ST : RO ;bitpos:[2] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_HSCH2_INT_ST  (BIT(2))
#define LEDC_OVF_CNT_HSCH2_INT_ST_M  (BIT(2))
#define LEDC_OVF_CNT_HSCH2_INT_ST_V  0x1
#define LEDC_OVF_CNT_HSCH2_INT_ST_S  2
/* LEDC_OVF_CNT_HSCH1_INT_ST : RO ;bitpos:[1] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_HSCH1_INT_ST  (BIT(1))
#define LEDC_OVF_CNT_HSCH1_INT_ST_M  (BIT(1))
#define LEDC_OVF_CNT_HSCH1_INT_ST_V  0x1
#define LEDC_OVF_CNT_HSCH1_INT_ST_S  1
/* LEDC_OVF_CNT_HSCH0_INT_ST : RO ;bitpos:[0] ;default: 1'h0 ; */
/*description: */
#define LEDC_OVF_CNT_HSCH0_INT_ST  (BIT(0))
#define LEDC_OVF_CNT_HSCH0_INT_ST_M  (BIT(0))
#define LEDC_OVF_CNT_HSCH0_INT_ST_V  0x1
#define LEDC_OVF_CNT_HSCH0_INT_ST_S  0

#define LEDC_INT1_ENA_REG          (DR_REG_LEDC_BASE + 0x019c)
/* LEDC_OVF_CNT_LSCH7_INT_ENA : R/W ;bitpos:[15] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_LSCH7_INT_ENA  (BIT(15))
#define LEDC_OVF_CNT_LSCH7_INT_ENA_M  (BIT(15))
#define LEDC_OVF_CNT_LSCH7_INT_ENA_V  0x1
#define LEDC_OVF_CNT_LSCH7_INT_ENA_S  15
/* LEDC_OVF_CNT_LSCH6_INT_ENA : R/W ;bitpos:[14] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_LSCH6_INT_ENA  (BIT(14))
#define LEDC_OVF_CNT_LSCH6_INT_ENA_M  (BIT(14))
#define LEDC_OVF_CNT_LSCH6_INT_ENA_V  0x1
#define LEDC_OVF_CNT_LSCH6_INT_ENA_S  14
/* LEDC_OVF_CNT_LSCH5_INT_ENA : R/W ;bitpos:[13] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_LSCH5_INT_ENA  (BIT(13))
#define LEDC_OVF_CNT_LSCH5_INT_ENA_M  (BIT(13))
#define LEDC_OVF_CNT_LSCH5_INT_ENA_V  0x1
#define LEDC_OVF_CNT_LSCH5_INT_ENA_S  13
/* LEDC_OVF_CNT_LSCH4_INT_ENA : R/W ;bitpos:[12] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_LSCH4_INT_ENA  (BIT(12))
#define LEDC_OVF_CNT_LSCH4_INT_ENA_M  (BIT(12))
#define LEDC_OVF_CNT_LSCH4_INT_ENA_V  0x1
#define LEDC_OVF_CNT_LSCH4_INT_ENA_S  12
/* LEDC_OVF_CNT_LSCH3_INT_ENA : R/W ;bitpos:[11] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_LSCH3_INT_ENA  (BIT(11))
#define LEDC_OVF_CNT_LSCH3_INT_ENA_M  (BIT(11))
#define LEDC_OVF_CNT_LSCH3_INT_ENA_V  0x1
#define LEDC_OVF_CNT_LSCH3_INT_ENA_S  11
/* LEDC_OVF_CNT_LSCH2_INT_ENA : R/W ;bitpos:[10] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_LSCH2_INT_ENA  (BIT(10))
#define LEDC_OVF_CNT_LSCH2_INT_ENA_M  (BIT(10))
#define LEDC_OVF_CNT_LSCH2_INT_ENA_V  0x1
#define LEDC_OVF_CNT_LSCH2_INT_ENA_S  10
/* LEDC_OVF_CNT_LSCH1_INT_ENA : R/W ;bitpos:[9] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_LSCH1_INT_ENA  (BIT(9))
#define LEDC_OVF_CNT_LSCH1_INT_ENA_M  (BIT(9))
#define LEDC_OVF_CNT_LSCH1_INT_ENA_V  0x1
#define LEDC_OVF_CNT_LSCH1_INT_ENA_S  9
/* LEDC_OVF_CNT_LSCH0_INT_ENA : R/W ;bitpos:[8] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_LSCH0_INT_ENA  (BIT(8))
#define LEDC_OVF_CNT_LSCH0_INT_ENA_M  (BIT(8))
#define LEDC_OVF_CNT_LSCH0_INT_ENA_V  0x1
#define LEDC_OVF_CNT_LSCH0_INT_ENA_S  8
/* LEDC_OVF_CNT_HSCH7_INT_ENA : R/W ;bitpos:[7] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_HSCH7_INT_ENA  (BIT(7))
#define LEDC_OVF_CNT_HSCH7_INT_ENA_M  (BIT(7))
#define LEDC_OVF_CNT_HSCH7_INT_ENA_V  0x1
#define LEDC_OVF_CNT_HSCH7_INT_ENA_S  7
/* LEDC_OVF_CNT_HSCH6_INT_ENA : R/W ;bitpos:[6] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_HSCH6_INT_ENA  (BIT(6))
#define LEDC_OVF_CNT_HSCH6_INT_ENA_M  (BIT(6))
#define LEDC_OVF_CNT_HSCH6_INT_ENA_V  0x1
#define LEDC_OVF_CNT_HSCH6_INT_ENA_S  6
/* LEDC_OVF_CNT_HSCH5_INT_ENA : R/W ;bitpos:[5] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_HSCH5_INT_ENA  (BIT(5))
#define LEDC_OVF_CNT_HSCH5_INT_ENA_M  (BIT(5))
#define LEDC_OVF_CNT_HSCH5_INT_ENA_V  0x1
#define LEDC_OVF_CNT_HSCH5_INT_ENA_S  5
/* LEDC_OVF_CNT_HSCH4_INT_ENA : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_HSCH4_INT_ENA  (BIT(4))
#define LEDC_OVF_CNT_HSCH4_INT_ENA_M  (BIT(4))
#define LEDC_OVF_CNT_HSCH4_INT_ENA_V  0x1
#define LEDC_OVF_CNT_HSCH4_INT_ENA_S  4
/* LEDC_OVF_CNT_HSCH3_INT_ENA : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_HSCH3_INT_ENA  (BIT(3))
#define LEDC_OVF_CNT_HSCH3_INT_ENA_M  (BIT(3))
#define LEDC_OVF_CNT_HSCH3_INT_ENA_V  0x1
#define LEDC_OVF_CNT_HSCH3_INT_ENA_S  3
/* LEDC_OVF_CNT_HSCH2_INT_ENA : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_HSCH2_INT_ENA  (BIT(2))
#define LEDC_OVF_CNT_HSCH2_INT_ENA_M  (BIT(2))
#define LEDC_OVF_CNT_HSCH2_INT_ENA_V  0x1
#define LEDC_OVF_CNT_HSCH2_INT_ENA_S  2
/* LEDC_OVF_CNT_HSCH1_INT_ENA : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_HSCH1_INT_ENA  (BIT(1))
#define LEDC_OVF_CNT_HSCH1_INT_ENA_M  (BIT(1))
#define LEDC_OVF_CNT_HSCH1_INT_ENA_V  0x1
#define LEDC_OVF_CNT_HSCH1_INT_ENA_S  1
/* LEDC_OVF_CNT_HSCH0_INT_ENA : R/W ;bitpos:[0] ;default: 1'h0 ; */
/*description: */
#define LEDC_OVF_CNT_HSCH0_INT_ENA  (BIT(0))
#define LEDC_OVF_CNT_HSCH0_INT_ENA_M  (BIT(0))
#define LEDC_OVF_CNT_HSCH0_INT_ENA_V  0x1
#define LEDC_OVF_CNT_HSCH0_INT_ENA_S  0

#define LEDC_INT1_CLR_REG          (DR_REG_LEDC_BASE + 0x01a0)
/* LEDC_OVF_CNT_LSCH7_INT_CLR : WO ;bitpos:[15] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_LSCH7_INT_CLR  (BIT(15))
#define LEDC_OVF_CNT_LSCH7_INT_CLR_M  (BIT(15))
#define LEDC_OVF_CNT_LSCH7_INT_CLR_V  0x1
#define LEDC_OVF_CNT_LSCH7_INT_CLR_S  15
/* LEDC_OVF_CNT_LSCH6_INT_CLR : WO ;bitpos:[14] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_LSCH6_INT_CLR  (BIT(14))
#define LEDC_OVF_CNT_LSCH6_INT_CLR_M  (BIT(14))
#define LEDC_OVF_CNT_LSCH6_INT_CLR_V  0x1
#define LEDC_OVF_CNT_LSCH6_INT_CLR_S  14
/* LEDC_OVF_CNT_LSCH5_INT_CLR : WO ;bitpos:[13] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_LSCH5_INT_CLR  (BIT(13))
#define LEDC_OVF_CNT_LSCH5_INT_CLR_M  (BIT(13))
#define LEDC_OVF_CNT_LSCH5_INT_CLR_V  0x1
#define LEDC_OVF_CNT_LSCH5_INT_CLR_S  13
/* LEDC_OVF_CNT_LSCH4_INT_CLR : WO ;bitpos:[12] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_LSCH4_INT_CLR  (BIT(12))
#define LEDC_OVF_CNT_LSCH4_INT_CLR_M  (BIT(12))
#define LEDC_OVF_CNT_LSCH4_INT_CLR_V  0x1
#define LEDC_OVF_CNT_LSCH4_INT_CLR_S  12
/* LEDC_OVF_CNT_LSCH3_INT_CLR : WO ;bitpos:[11] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_LSCH3_INT_CLR  (BIT(11))
#define LEDC_OVF_CNT_LSCH3_INT_CLR_M  (BIT(11))
#define LEDC_OVF_CNT_LSCH3_INT_CLR_V  0x1
#define LEDC_OVF_CNT_LSCH3_INT_CLR_S  11
/* LEDC_OVF_CNT_LSCH2_INT_CLR : WO ;bitpos:[10] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_LSCH2_INT_CLR  (BIT(10))
#define LEDC_OVF_CNT_LSCH2_INT_CLR_M  (BIT(10))
#define LEDC_OVF_CNT_LSCH2_INT_CLR_V  0x1
#define LEDC_OVF_CNT_LSCH2_INT_CLR_S  10
/* LEDC_OVF_CNT_LSCH1_INT_CLR : WO ;bitpos:[9] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_LSCH1_INT_CLR  (BIT(9))
#define LEDC_OVF_CNT_LSCH1_INT_CLR_M  (BIT(9))
#define LEDC_OVF_CNT_LSCH1_INT_CLR_V  0x1
#define LEDC_OVF_CNT_LSCH1_INT_CLR_S  9
/* LEDC_OVF_CNT_LSCH0_INT_CLR : WO ;bitpos:[8] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_LSCH0_INT_CLR  (BIT(8))
#define LEDC_OVF_CNT_LSCH0_INT_CLR_M  (BIT(8))
#define LEDC_OVF_CNT_LSCH0_INT_CLR_V  0x1
#define LEDC_OVF_CNT_LSCH0_INT_CLR_S  8
/* LEDC_OVF_CNT_HSCH7_INT_CLR : WO ;bitpos:[7] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_HSCH7_INT_CLR  (BIT(7))
#define LEDC_OVF_CNT_HSCH7_INT_CLR_M  (BIT(7))
#define LEDC_OVF_CNT_HSCH7_INT_CLR_V  0x1
#define LEDC_OVF_CNT_HSCH7_INT_CLR_S  7
/* LEDC_OVF_CNT_HSCH6_INT_CLR : WO ;bitpos:[6] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_HSCH6_INT_CLR  (BIT(6))
#define LEDC_OVF_CNT_HSCH6_INT_CLR_M  (BIT(6))
#define LEDC_OVF_CNT_HSCH6_INT_CLR_V  0x1
#define LEDC_OVF_CNT_HSCH6_INT_CLR_S  6
/* LEDC_OVF_CNT_HSCH5_INT_CLR : WO ;bitpos:[5] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_HSCH5_INT_CLR  (BIT(5))
#define LEDC_OVF_CNT_HSCH5_INT_CLR_M  (BIT(5))
#define LEDC_OVF_CNT_HSCH5_INT_CLR_V  0x1
#define LEDC_OVF_CNT_HSCH5_INT_CLR_S  5
/* LEDC_OVF_CNT_HSCH4_INT_CLR : WO ;bitpos:[4] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_HSCH4_INT_CLR  (BIT(4))
#define LEDC_OVF_CNT_HSCH4_INT_CLR_M  (BIT(4))
#define LEDC_OVF_CNT_HSCH4_INT_CLR_V  0x1
#define LEDC_OVF_CNT_HSCH4_INT_CLR_S  4
/* LEDC_OVF_CNT_HSCH3_INT_CLR : WO ;bitpos:[3] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_HSCH3_INT_CLR  (BIT(3))
#define LEDC_OVF_CNT_HSCH3_INT_CLR_M  (BIT(3))
#define LEDC_OVF_CNT_HSCH3_INT_CLR_V  0x1
#define LEDC_OVF_CNT_HSCH3_INT_CLR_S  3
/* LEDC_OVF_CNT_HSCH2_INT_CLR : WO ;bitpos:[2] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_HSCH2_INT_CLR  (BIT(2))
#define LEDC_OVF_CNT_HSCH2_INT_CLR_M  (BIT(2))
#define LEDC_OVF_CNT_HSCH2_INT_CLR_V  0x1
#define LEDC_OVF_CNT_HSCH2_INT_CLR_S  2
/* LEDC_OVF_CNT_HSCH1_INT_CLR : WO ;bitpos:[1] ;default: 1'b0 ; */
/*description: */
#define LEDC_OVF_CNT_HSCH1_INT_CLR  (BIT(1))
#define LEDC_OVF_CNT_HSCH1_INT_CLR_M  (BIT(1))
#define LEDC_OVF_CNT_HSCH1_INT_CLR_V  0x1
#define LEDC_OVF_CNT_HSCH1_INT_CLR_S  1
/* LEDC_OVF_CNT_HSCH0_INT_CLR : WO ;bitpos:[0] ;default: 1'h0 ; */
/*description: */
#define LEDC_OVF_CNT_HSCH0_INT_CLR  (BIT(0))
#define LEDC_OVF_CNT_HSCH0_INT_CLR_M  (BIT(0))
#define LEDC_OVF_CNT_HSCH0_INT_CLR_V  0x1
#define LEDC_OVF_CNT_HSCH0_INT_CLR_S  0

#define LEDC_DATE_REG          (DR_REG_LEDC_BASE + 0x01FC)
/* LEDC_DATE : R/W ;bitpos:[31:0] ;default: 32'h18051200 ; */
/*description: */
#define LEDC_DATE  0xFFFFFFFF
#define LEDC_DATE_M  ((LEDC_DATE_V)<<(LEDC_DATE_S))
#define LEDC_DATE_V  0xFFFFFFFF
#define LEDC_DATE_S  0

#ifdef __cplusplus
}
#endif



#endif /*_SOC_LEDC_REG_H_ */


